Процедура TRASSIR_УстановитьСоединение(пWS) Экспорт
	Если НЕ Константы.TRASSIR_Использовать.Получить() Тогда  				Возврат 	КонецЕсли;
	
	пWS 																	= Новый ComОбъект("MSWinsock.Winsock");
	
	Адрес																	= СокрЛП(Константы.TRASSIR_Адрес.Получить());
	Порт																	= СокрЛП(Константы.TRASSIR_Порт.Получить());
	
	Если пWS.State<>7 Тогда
		Если пWS.State<>0 Тогда
			пWS.Close();
		КонецЕсли;

		пWS.RemoteHost 														= СокрЛП(Адрес);
		пWS.RemotePort 														= СокрЛП(Порт);

		пWS.Connect();
	КонецЕсли;
КонецПроцедуры

Процедура TRASSIR_ОбработатьСобытие(Параметры, пWS) Экспорт 
	Если НЕ Константы.TRASSIR_Использовать.Получить() Тогда  				Возврат 	КонецЕсли;
	
	Если пWS=Неопределено	Тогда 
		TRASSIR_УстановитьСоединение(пWS);
	КонецЕсли;	
	
	СообщениеXML 															= "<?xml version=""1.0"" encoding=""cp1251""?><transaction>" + Символы.ПС;															

	Для каждого Стр Из Параметры Цикл
		СообщениеXML 														= СообщениеXML + "<" + Стр.Ключ + ">" + Стр.Значение + "</" + Стр.Ключ + ">" + Символы.ПС;
	КонецЦикла;
	СообщениеXML 															= СообщениеXML + "</transaction>";

	Если пWS.State=7 Тогда
		пWS.SendData(СокрЛП(СообщениеXML));
	КонецЕсли;
КонецПроцедуры


/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

Процедура ТRASSIR_ВХОД_ИЛИ_ВЫХОД_В_РЕЖИМ_КАССИРА(пWS, ВходКассира) Экспорт
	Если ВходКассира Тогда   
		/////// Отправка данных на TRASSIR
		глGUID_Смены_VS    														= Новый УникальныйИдентификатор;
		
		ПараметрыСобытия 														= Новый Структура;
		ПараметрыСобытия.Вставить("event_type", 			"POSNG_CASHIER_LOGIN");
		ПараметрыСобытия.Вставить("operation_id", 			глGUID_ЧекаККМ_VS);
		ПараметрыСобытия.Вставить("text", 					глТекущийПользователь);
		ПараметрыСобытия.Вставить("date", 					Формат(ТекущаяДата(), "ДФ=MM/dd/yyyy"));
		ПараметрыСобытия.Вставить("time", 					Формат(ТекущаяДата(), "ДЛФ=T"));
		
		МодульTRASSIR.TRASSIR_ОбработатьСобытие(ПараметрыСобытия, пWS);
		/////// Отправка данных на TRASSIR
	Иначе 
		/////// Отправка данных на TRASSIR
		глGUID_Смены_VS    														= Новый УникальныйИдентификатор;
		
		ПараметрыСобытия 														= Новый Структура;
		ПараметрыСобытия.Вставить("event_type", 			"POSNG_CASHIER_LOGOUT");
		ПараметрыСобытия.Вставить("operation_id", 			глGUID_ЧекаККМ_VS);
		ПараметрыСобытия.Вставить("text", 					глТекущийПользователь);
		ПараметрыСобытия.Вставить("date", 					Формат(ТекущаяДата(), "ДФ=MM/dd/yyyy"));
		ПараметрыСобытия.Вставить("time", 					Формат(ТекущаяДата(), "ДЛФ=T"));
		
		МодульTRASSIR.TRASSIR_ОбработатьСобытие(ПараметрыСобытия, пWS);
		/////// Отправка данных на TRASSIR
		
		Если НЕ Константы.TRASSIR_Использовать.Получить() Тогда  				Возврат 	КонецЕсли;
		
		Предупреждение(" Отправка данных на TRASSIR ...", 1, );	
	КонецЕсли;	

КонецПроцедуры	

Процедура ТRASSIR_ИНКАССАЦИЯ(пWS, Сумма) Экспорт
		/////// Отправка данных на TRASSIR
	ПараметрыСобытия = Новый Структура;
	ПараметрыСобытия.Вставить("event_type", 			"POSNG_MONEYBOX_WITHDRAWAL");
	ПараметрыСобытия.Вставить("operation_id", 			глGUID_ЧекаККМ_VS);
	ПараметрыСобытия.Вставить("cashier", 				глТекущийПользователь);
	ПараметрыСобытия.Вставить("date", 					Формат(ТекущаяДата(), "ДФ=MM/dd/yyyy"));
	ПараметрыСобытия.Вставить("time", 					Формат(ТекущаяДата(), "ДЛФ=T"));
	ПараметрыСобытия.Вставить("text", 					Формат(Сумма, "ЧДЦ=2; ЧН=; ЧГ=0"));

	МодульTRASSIR.TRASSIR_ОбработатьСобытие(ПараметрыСобытия, WS);
	/////// Отправка данных на TRASSIR
КонецПроцедуры	

Процедура ТRASSIR_ВНЕСЕНИЕ(пWS, Сумма) Экспорт
	/////// Отправка данных на TRASSIR
	ПараметрыСобытия = Новый Структура;
	ПараметрыСобытия.Вставить("event_type", 			"POSNG_MONEYBOX_DEPOSITION");
	ПараметрыСобытия.Вставить("operation_id", 			глGUID_ЧекаККМ_VS);
	ПараметрыСобытия.Вставить("cashier", 				глТекущийПользователь);
	ПараметрыСобытия.Вставить("date", 					Формат(ТекущаяДата(), "ДФ=MM/dd/yyyy"));
	ПараметрыСобытия.Вставить("time", 					Формат(ТекущаяДата(), "ДЛФ=T"));
	ПараметрыСобытия.Вставить("text", 					Формат(Сумма, "ЧДЦ=2; ЧН=; ЧГ=0"));

	МодульTRASSIR.TRASSIR_ОбработатьСобытие(ПараметрыСобытия, WS);
	/////// Отправка данных на TRASSIR
КонецПроцедуры	

Процедура ТRASSIR_НУЛЕВОЙ_ЧЕК(пWS) Экспорт 
	
	/////// Отправка данных на TRASSIR
	ПараметрыСобытия = Новый Структура;
	ПараметрыСобытия.Вставить("event_type", 			"POSNG_RECEIPT_FINAL_RESULT_IS_NULL");
	ПараметрыСобытия.Вставить("operation_id", 			глGUID_ЧекаККМ_VS);
	ПараметрыСобытия.Вставить("cashier", 				глТекущийПользователь);
	ПараметрыСобытия.Вставить("date", 					Формат(ТекущаяДата(), "ДФ=MM/dd/yyyy"));
	ПараметрыСобытия.Вставить("time", 					Формат(ТекущаяДата(), "ДЛФ=T"));
	
	МодульTRASSIR.TRASSIR_ОбработатьСобытие(ПараметрыСобытия, пWS);
	/////// Отправка данных на TRASSIR
	
КонецПроцедуры


Процедура ТRASSIR_POSNG_COMMENT(пWS, ТекстКоментария) Экспорт 

	///////// Отправка данных на TRASSIR
	ПараметрыСобытия = Новый Структура;
	ПараметрыСобытия.Вставить("event_type", 			"POSNG_COMMENT");
	ПараметрыСобытия.Вставить("operation_id", 			глGUID_ЧекаККМ_VS);
	ПараметрыСобытия.Вставить("date", 					Формат(ТекущаяДата(), "ДФ=MM/dd/yyyy"));
	ПараметрыСобытия.Вставить("time", 					Формат(ТекущаяДата(), "ДЛФ=T"));
	ПараметрыСобытия.Вставить("text", 					ТекстКоментария);
		
	TRASSIR_ОбработатьСобытие(ПараметрыСобытия, пWS);
	///////// Отправка данных на TRASSIR

КонецПроцедуры	



Процедура ТRASSIR_ДОБАВИТЬ_ТОВАР(пWS, СтрокаТЧ) Экспорт 
 
	ПараметрыСобытия 														= Новый Структура;
	ПараметрыСобытия.Вставить("event_type", 			"POSNG_POSITION_ADD");
	ПараметрыСобытия.Вставить("operation_id", 			глGUID_ЧекаККМ_VS);
	ПараметрыСобытия.Вставить("cashier", 				глТекущийПользователь);
	ПараметрыСобытия.Вставить("date", 					Формат(ТекущаяДата(), "ДФ=MM/dd/yyyy"));
	ПараметрыСобытия.Вставить("time", 					Формат(ТекущаяДата(), "ДЛФ=T"));
	ПараметрыСобытия.Вставить("position", 				СтрокаТЧ.НомерСтроки);
	ПараметрыСобытия.Вставить("code", 					СтрокаТЧ.Код);
	ПараметрыСобытия.Вставить("barcode", 				СтрокаТЧ.Штрихкод);
	ПараметрыСобытия.Вставить("name", 					СтрокаТЧ.DATASTR1);
	ПараметрыСобытия.Вставить("round", 					0);
	ПараметрыСобытия.Вставить("quantity", 				СтрокаТЧ.Количество);
	ПараметрыСобытия.Вставить("price", 					СтрокаТЧ.Цена);
		
	МодульTRASSIR.TRASSIR_ОбработатьСобытие(ПараметрыСобытия, пWS);	
КонецПроцедуры	

Процедура ТRASSIR_ДОБАВИТЬ_ТОВАР_УМНОЖЕНИЕМ(пWS, НужноеКоличество) Экспорт 
	/////// Отправка данных на TRASSIR
	ПараметрыСобытия 						= Новый Структура;
	ПараметрыСобытия.Вставить("event_type", 			"POSNG_POSITION_ENTER_AMOUNT_OF_GOODS_MANUALLY");
	ПараметрыСобытия.Вставить("operation_id", 			глGUID_ЧекаККМ_VS);
	ПараметрыСобытия.Вставить("cashier", 				глТекущийПользователь);
	ПараметрыСобытия.Вставить("date", 					Формат(ТекущаяДата(), "ДФ=MM/dd/yyyy"));
	ПараметрыСобытия.Вставить("time", 					Формат(ТекущаяДата(), "ДЛФ=T"));
	ПараметрыСобытия.Вставить("text", 					"x"+НужноеКоличество);
		
	МодульTRASSIR.TRASSIR_ОбработатьСобытие(ПараметрыСобытия, пWS);
	/////// Отправка данных на TRASSIR

КонецПроцедуры	



Процедура ТRASSIR_ОТКРЫТЬ_ЧЕК(пWS, ПродажаТЧ) Экспорт 

	Если ПродажаТЧ.Количество()>1 Тогда 					Возврат			КонецЕсли;
	
	Если НЕ РежимВозвратаЧека Тогда 
		ПараметрыСобытия 													= Новый Структура;
		ПараметрыСобытия.Вставить("event_type", 			"POSNG_RECEIPT_OPEN");
		ПараметрыСобытия.Вставить("operation_id", 			глGUID_ЧекаККМ_VS);
		ПараметрыСобытия.Вставить("cashier", 				глТекущийПользователь);
		ПараметрыСобытия.Вставить("date", 					Формат(ТекущаяДата(), "ДФ=MM/dd/yyyy"));
		ПараметрыСобытия.Вставить("time", 					Формат(ТекущаяДата(), "ДЛФ=T"));
		
		МодульTRASSIR.TRASSIR_ОбработатьСобытие(ПараметрыСобытия, пWS);
	Иначе 
		ПараметрыСобытия 													= Новый Структура;
		ПараметрыСобытия.Вставить("event_type", 			"POSNG_RECEIPT_RETURN");
		ПараметрыСобытия.Вставить("operation_id", 			глGUID_ЧекаККМ_VS);
		ПараметрыСобытия.Вставить("cashier", 				глТекущийПользователь);
		ПараметрыСобытия.Вставить("date", 					Формат(ТекущаяДата(), "ДФ=MM/dd/yyyy"));
		ПараметрыСобытия.Вставить("time", 					Формат(ТекущаяДата(), "ДЛФ=T"));
		
		МодульTRASSIR.TRASSIR_ОбработатьСобытие(ПараметрыСобытия, пWS);
	КонецЕсли;	
	
	ПараметрыСобытия 													= Новый Структура;
	ПараметрыСобытия.Вставить("event_type", 			"POSNG_RECEIPT_NUMBER");
	ПараметрыСобытия.Вставить("operation_id", 			глGUID_ЧекаККМ_VS);
	ПараметрыСобытия.Вставить("cashier", 				глТекущийПользователь);
	ПараметрыСобытия.Вставить("date", 					Формат(ТекущаяДата(), "ДФ=MM/dd/yyyy"));
	ПараметрыСобытия.Вставить("time", 					Формат(ТекущаяДата(), "ДЛФ=T"));
	ПараметрыСобытия.Вставить("text", 					глНомерПоследнегоЧека_VS+1);

	МодульTRASSIR.TRASSIR_ОбработатьСобытие(ПараметрыСобытия, пWS);

	
КонецПроцедуры	

Процедура ТRASSIR_ЗАКРЫТЬ_ЧЕК(пWS, ПродажаТЧ) Экспорт 

	Если ПродажаТЧ.Количество()=0 Тогда 					Возврат			КонецЕсли;
	
	Если НЕ РежимВозвратаЧека Тогда 
		/////// Отправка данных на TRASSIR	
		ПараметрыСобытия 														= Новый Структура;
		ПараметрыСобытия.Вставить("event_type", 			"POSNG_RECEIPT_SELL_CLOSE");
		ПараметрыСобытия.Вставить("operation_id", 			глGUID_ЧекаККМ_VS);
		ПараметрыСобытия.Вставить("cashier", 				глТекущийПользователь);
		ПараметрыСобытия.Вставить("date", 					Формат(ТекущаяДата(), "ДФ=MM/dd/yyyy"));
		ПараметрыСобытия.Вставить("time", 					Формат(ТекущаяДата(), "ДЛФ=T"));
			
		МодульTRASSIR.TRASSIR_ОбработатьСобытие(ПараметрыСобытия, пWS);
		/////// Отправка данных на TRASSIR
	Иначе 
		/////// Отправка данных на TRASSIR	
		ПараметрыСобытия 														= Новый Структура;
		ПараметрыСобытия.Вставить("event_type", 			"POSNG_RECEIPT_RETURN_CLOSE");
		ПараметрыСобытия.Вставить("operation_id", 			глGUID_ЧекаККМ_VS);
		ПараметрыСобытия.Вставить("cashier", 				глТекущийПользователь);
		ПараметрыСобытия.Вставить("date", 					Формат(ТекущаяДата(), "ДФ=MM/dd/yyyy"));
		ПараметрыСобытия.Вставить("time", 					Формат(ТекущаяДата(), "ДЛФ=T"));
			
		МодульTRASSIR.TRASSIR_ОбработатьСобытие(ПараметрыСобытия, пWS);
		/////// Отправка данных на TRASSIR
	КонецЕсли;	
КонецПроцедуры	


Процедура ТRASSIR_ОТМЕНА_РАСЧЕТА_ЧЕКА(пWS) Экспорт
	/////// Отправка данных на TRASSIR	
	ПараметрыСобытия 														= Новый Структура;
	ПараметрыСобытия.Вставить("event_type", 			"POSNG_DISCOUNT_CANCEL");
	ПараметрыСобытия.Вставить("operation_id", 			глGUID_ЧекаККМ_VS);
	ПараметрыСобытия.Вставить("cashier", 				глТекущийПользователь);
	ПараметрыСобытия.Вставить("date", 					Формат(ТекущаяДата(), "ДФ=MM/dd/yyyy"));
	ПараметрыСобытия.Вставить("time", 					Формат(ТекущаяДата(), "ДЛФ=T"));

	МодульTRASSIR.TRASSIR_ОбработатьСобытие(ПараметрыСобытия, пWS);
	
	
	ПараметрыСобытия 														= Новый Структура;
	ПараметрыСобытия.Вставить("event_type", 			"POSNG_PAYMENT_CANCEL");
	ПараметрыСобытия.Вставить("operation_id", 			глGUID_ЧекаККМ_VS);
	ПараметрыСобытия.Вставить("cashier", 				глТекущийПользователь);
	ПараметрыСобытия.Вставить("date", 					Формат(ТекущаяДата(), "ДФ=MM/dd/yyyy"));
	ПараметрыСобытия.Вставить("time", 					Формат(ТекущаяДата(), "ДЛФ=T"));

	МодульTRASSIR.TRASSIR_ОбработатьСобытие(ПараметрыСобытия, пWS);

	/////// Отправка данных на TRASSIR
КонецПроцедуры	


Процедура ТRASSIR_АННУЛЯЦИЯ_СТРОКИ_ЧЕКА(пWS, СтрокаТЧ) Экспорт
		/////// Отправка данных на TRASSIR
	ПараметрыСобытия 														= Новый Структура;
	ПараметрыСобытия.Вставить("event_type", 			"POSNG_POSITION_CANCEL");
	ПараметрыСобытия.Вставить("operation_id", 			глGUID_ЧекаККМ_VS);
	ПараметрыСобытия.Вставить("cashier", 				глТекущийПользователь);
	ПараметрыСобытия.Вставить("date", 					Формат(ТекущаяДата(), "ДФ=MM/dd/yyyy"));
	ПараметрыСобытия.Вставить("time", 					Формат(ТекущаяДата(), "ДЛФ=T"));
	ПараметрыСобытия.Вставить("position", 				СтрокаТЧ.НомерСтроки);
	ПараметрыСобытия.Вставить("code", 					СтрокаТЧ.Код);
	ПараметрыСобытия.Вставить("name", 					СтрокаТЧ.DATASTR1);
	ПараметрыСобытия.Вставить("round", 					0);
	ПараметрыСобытия.Вставить("quantity", 				СтрокаТЧ.Количество);
	ПараметрыСобытия.Вставить("price", 					СтрокаТЧ.Цена);
	
	МодульTRASSIR.TRASSIR_ОбработатьСобытие(ПараметрыСобытия, пWS);
	/////// Отправка данных на TRASSIR

КонецПроцедуры

Процедура ТRASSIR_АННУЛЯЦИЯ_ВСЕГО_ЧЕКА(пWS) Экспорт
	/////// Отправка данных на TRASSIR
	ПараметрыСобытия 														= Новый Структура;
	ПараметрыСобытия.Вставить("event_type", 			"POSNG_RECEIPT_CANCEL");
	ПараметрыСобытия.Вставить("operation_id", 			глGUID_ЧекаККМ_VS);
	ПараметрыСобытия.Вставить("cashier", 				глТекущийПользователь);
	ПараметрыСобытия.Вставить("date", 					Формат(ТекущаяДата(), "ДФ=MM/dd/yyyy"));
	ПараметрыСобытия.Вставить("time", 					Формат(ТекущаяДата(), "ДЛФ=T"));
	ПараметрыСобытия.Вставить("text", 					"АНУЛЯЦИЯ ВСЕГО ЧЕКА !!!");
	
	МодульTRASSIR.TRASSIR_ОбработатьСобытие(ПараметрыСобытия, пWS);
	/////// Отправка данных на TRASSIR
КонецПроцедуры

Процедура ТRASSIR_X_ОТЧЕТ(пWS, Пользователь) Экспорт
	/////// Отправка данных на TRASSIR
	ПараметрыСобытия = Новый Структура;
	ПараметрыСобытия.Вставить("event_type", 			"POSNG_REPORT_X");
	ПараметрыСобытия.Вставить("operation_id", 			глGUID_ЧекаККМ_VS);
	ПараметрыСобытия.Вставить("cashier", 				Пользователь);
	ПараметрыСобытия.Вставить("date", 					Формат(ТекущаяДата(), "ДФ=MM/dd/yyyy"));
	ПараметрыСобытия.Вставить("time", 					Формат(ТекущаяДата(), "ДЛФ=T"));
	
	МодульTRASSIR.TRASSIR_ОбработатьСобытие(ПараметрыСобытия, пWS);
	/////// Отправка данных на TRASSIR
КонецПроцедуры	


Процедура ТRASSIR_Z_ОТЧЕТ(пWS) Экспорт
	/////// Отправка данных на TRASSIR
	ПараметрыСобытия = Новый Структура;
	ПараметрыСобытия.Вставить("event_type", 			"POSNG_REPORT_Z");
	ПараметрыСобытия.Вставить("operation_id", 			глGUID_ЧекаККМ_VS);
	ПараметрыСобытия.Вставить("cashier", 				глТекущийПользователь);
	ПараметрыСобытия.Вставить("date", 					Формат(ТекущаяДата(), "ДФ=MM/dd/yyyy"));
	ПараметрыСобытия.Вставить("time", 					Формат(ТекущаяДата(), "ДЛФ=T"));
	
	МодульTRASSIR.TRASSIR_ОбработатьСобытие(ПараметрыСобытия, пWS);
	/////// Отправка данных на TRASSIR
КонецПроцедуры	



Процедура ТRASSIR_СУММА_СКИДКИ_ПО_ПРОМО(пWS, СуммаСкидки) Экспорт
	/////// Отправка данных на TRASSIR	
	Если СуммаСкидки>0 Тогда 
		ПараметрыСобытия 													= Новый Структура;
		ПараметрыСобытия.Вставить("event_type", 			"POSNG_RECEIPT_DISCOUNT_PROMO");
		ПараметрыСобытия.Вставить("operation_id", 			глGUID_ЧекаККМ_VS);
		ПараметрыСобытия.Вставить("cashier", 				глТекущийПользователь);
		ПараметрыСобытия.Вставить("date", 					Формат(ТекущаяДата(), "ДФ=MM/dd/yyyy"));
		ПараметрыСобытия.Вставить("time", 					Формат(ТекущаяДата(), "ДЛФ=T"));
		ПараметрыСобытия.Вставить("text", 					"-"+Формат(СуммаСкидки, "ЧДЦ=2; ЧРД=."));
	
		МодульTRASSIR.TRASSIR_ОбработатьСобытие(ПараметрыСобытия, пWS);
	КонецЕсли;
	/////// Отправка данных на TRASSIR

КонецПроцедуры	

Процедура ТRASSIR_СУММА_СКИДКИ_ПО_БК(пWS, СуммаБонусами, СуммаСкидкиПоБК) Экспорт
	Если СуммаБонусами>0 Тогда
		/////// Отправка данных на TRASSIR
		ПараметрыСобытия 												= Новый Структура;
		ПараметрыСобытия.Вставить("event_type", 			"POSNG_PAYMENT_BONUS_CARD");
		ПараметрыСобытия.Вставить("operation_id", 			глGUID_ЧекаККМ_VS);
		ПараметрыСобытия.Вставить("cashier", 				глТекущийПользователь);
		ПараметрыСобытия.Вставить("date", 					Формат(ТекущаяДата(), "ДФ=MM/dd/yyyy"));
		ПараметрыСобытия.Вставить("time", 					Формат(ТекущаяДата(), "ДЛФ=T"));
		ПараметрыСобытия.Вставить("text", 					"-"+Формат(СуммаБонусами, "ЧДЦ=2; ЧРД=."));
	
		МодульTRASSIR.TRASSIR_ОбработатьСобытие(ПараметрыСобытия, пWS);
		/////// Отправка данных на TRASSIR
	КонецЕсли;	

	Если СуммаСкидкиПоБК>0 Тогда 		
		/////// Отправка данных на TRASSIR
		ПараметрыСобытия 												= Новый Структура;
		ПараметрыСобытия.Вставить("event_type", 			"POSNG_RECEIPT_DISCOUNT_LOYALITY");
		ПараметрыСобытия.Вставить("operation_id", 			глGUID_ЧекаККМ_VS);
		ПараметрыСобытия.Вставить("cashier", 				глТекущийПользователь);
		ПараметрыСобытия.Вставить("date", 					Формат(ТекущаяДата(), "ДФ=MM/dd/yyyy"));
		ПараметрыСобытия.Вставить("time", 					Формат(ТекущаяДата(), "ДЛФ=T"));
		ПараметрыСобытия.Вставить("text", 					"-"+Формат(СуммаСкидкиПоБК, "ЧДЦ=2; ЧРД=."));
	
		МодульTRASSIR.TRASSIR_ОбработатьСобытие(ПараметрыСобытия, пWS);
		/////// Отправка данных на TRASSIR
	КонецЕсли;	
КонецПроцедуры	


Процедура ТRASSIR_НАЖАТА_КНОПКА_ОПЛАТИТЬ(пWS, СуммаЧекаИтого, СуммаПоКарте, СуммаНалички, Сдача) Экспорт
	/////// Отправка данных на TRASSIR	
	Если СуммаЧекаИтого>0 Тогда 
		ПараметрыСобытия 														= Новый Структура;
		ПараметрыСобытия.Вставить("event_type", 			"POSNG_RECEIPT_FINAL_RESULT");
		ПараметрыСобытия.Вставить("operation_id", 			глGUID_ЧекаККМ_VS);
		ПараметрыСобытия.Вставить("cashier", 				глТекущийПользователь);
		ПараметрыСобытия.Вставить("date", 					Формат(ТекущаяДата(), "ДФ=MM/dd/yyyy"));
		ПараметрыСобытия.Вставить("time", 					Формат(ТекущаяДата(), "ДЛФ=T"));
		ПараметрыСобытия.Вставить("price", 					СуммаЧекаИтого);
	
		МодульTRASSIR.TRASSIR_ОбработатьСобытие(ПараметрыСобытия, пWS);
	КонецЕсли;
	
	Если СуммаПоКарте>0 Тогда 
		ПараметрыСобытия 														= Новый Структура;
		ПараметрыСобытия.Вставить("event_type", 			"POSNG_PAYMENT_CASHLESS");
		ПараметрыСобытия.Вставить("operation_id", 			глGUID_ЧекаККМ_VS);
		ПараметрыСобытия.Вставить("cashier", 				глТекущийПользователь);
		ПараметрыСобытия.Вставить("date", 					Формат(ТекущаяДата(), "ДФ=MM/dd/yyyy"));
		ПараметрыСобытия.Вставить("time", 					Формат(ТекущаяДата(), "ДЛФ=T"));
		ПараметрыСобытия.Вставить("price", 					СуммаПоКарте);
	
		МодульTRASSIR.TRASSIR_ОбработатьСобытие(ПараметрыСобытия, пWS);
	КонецЕсли;
	
	Если СуммаНалички>0 Тогда 
		ПараметрыСобытия 														= Новый Структура;
		ПараметрыСобытия.Вставить("event_type", 			"POSNG_PAYMENT_CASH");
		ПараметрыСобытия.Вставить("operation_id", 			глGUID_ЧекаККМ_VS);
		ПараметрыСобытия.Вставить("cashier", 				глТекущийПользователь);
		ПараметрыСобытия.Вставить("date", 					Формат(ТекущаяДата(), "ДФ=MM/dd/yyyy"));
		ПараметрыСобытия.Вставить("time", 					Формат(ТекущаяДата(), "ДЛФ=T"));
		ПараметрыСобытия.Вставить("price", 					СуммаНалички);
		
		МодульTRASSIR.TRASSIR_ОбработатьСобытие(ПараметрыСобытия, пWS);
	КонецЕсли;

	Если Сдача>0 Тогда 
		ПараметрыСобытия 														= Новый Структура;
		ПараметрыСобытия.Вставить("event_type", 			"POSNG_RECEIPT_CHANGE");
		ПараметрыСобытия.Вставить("operation_id", 			глGUID_ЧекаККМ_VS);
		ПараметрыСобытия.Вставить("cashier", 				глТекущийПользователь);
		ПараметрыСобытия.Вставить("date", 					Формат(ТекущаяДата(), "ДФ=MM/dd/yyyy"));
		ПараметрыСобытия.Вставить("time", 					Формат(ТекущаяДата(), "ДЛФ=T"));
		ПараметрыСобытия.Вставить("price", 					Сдача);
		
		МодульTRASSIR.TRASSIR_ОбработатьСобытие(ПараметрыСобытия, пWS);
	КонецЕсли;
	/////// Отправка данных на TRASSIR

КонецПроцедуры	

