
Процедура ОбработкаПроведения(Отказ, Режим)
	
	// регистр ДвижениеПС
	Движения.ДвиженияПС.Записывать = Истина;
	Движения.Скарбничка.Записывать = Истина;
	
	Движения.Скарбничка.Очистить();
	Движения.ДвиженияПС.Очистить(); 
	
	Если СостояниеЧекаККМ=Перечисления.СостояниеЧека.Аварийный_ПробитПоФР ИЛИ СостояниеЧекаККМ=Перечисления.СостояниеЧека.Закрыт Тогда 
		                                                            
		Для Каждого ТекСтрокаТЧ_ДвиженияПС Из ТЧ_ДвиженияПС Цикл
			Движение = Движения.ДвиженияПС.Добавить();
			Движение.Период			= Дата;
			Движение.ШК_ПС			= ТекСтрокаТЧ_ДвиженияПС.ШК_ПС;
			Движение.НоминалПС		= ТекСтрокаТЧ_ДвиженияПС.НоминалПС;
			Движение.СтатусПС		= ТекСтрокаТЧ_ДвиженияПС.СтатусПС;
			Движение.Подразделение	= Подразделение;
			Движение.КассаККМ		= КассаККМ;
			Движение.НомерЧекаККМ	= НомерЧекаККМ;
			Движение.ЭлектронныйПС	= ТекСтрокаТЧ_ДвиженияПС.ЭлектронныйПС;
			Движение.ИнфоКарта_ШК 	= ТекСтрокаТЧ_ДвиженияПС.ИнфоКарта_ШК;
		КонецЦикла;
		
		Если BPMonline_Скарбничка>0 И НЕ ПустаяСтрока(BPMonline_ШК) Тогда 
		  	Движение = Движения.Скарбничка.Добавить();
			Движение.Период					= Дата;
			Движение.НомерЧекаНаBPM			= СокрЛП(КассаККМ)+"_"+СокрЛП(НомерЧекаККМ);
			Движение.ШК_БК					= BPMonline_ШК;
			Движение.СдачаНаБК				= BPMonline_Скарбничка;
			Движение.ОтправленНаBPMonline 	= BPMonline_СкарбничкаОтправленна;
	    КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	НомерЧекаККМ_ТекущейСмены = РаботаСЧеком.ПолучитьНомерЧекаТекущейСмены(Ссылка, НомерZОтчета, ВидОперацииЧекаККМ);
КонецПроцедуры
