Процедура ДобавитьЗаписьЖурнала(Знач пУровеньРегистрации=Неопределено, Знач пПроцедура="" , Знач пКомментарий=Неопределено, Знач СтрокаТЧ = Неопределено, Знач ТЧ = Неопределено, Знач пВидСобытия="Comment", Знач пМетаданные=Неопределено) Экспорт 	
	
	Если пКомментарий=Неопределено И СтрокаТЧ=Неопределено И ТЧ=Неопределено 	Тогда 		Возврат		КонецЕсли;	
	
	Если пУровеньРегистрации=Неопределено Тогда 	
		пУровеньРегистрации			= УровеньЖурналаРегистрации.Примечание;
	КонецЕсли;	
	
	пКомментарий 					= ?(пКомментарий=Неопределено,"","<MESSAGE> "+пКомментарий+" </>");
	пПроцедура                    	= ?(ПустаяСтрока(пПроцедура),"", "<PROCESS> "+пПроцедура+" </>");

	Если СтрокаТЧ<>Неопределено Тогда 
		пКомментарий1 				=  	пПроцедура			+ Символы.ПС                                            +
										"Чек№: "			+ СтрокаТЧ.НомерЧека									+ ";  " + 
										//"Строка№: "			+ СтрокаТЧ.НомерСтроки 									+ ";  " + 
										//"Ануляция: "		+ СтрокаТЧ.Ануляция 									+ ";  " + 
										"Код: "				+ Формат(Число(СтрокаТЧ.Код),"ЧЦ=6; ЧВН=; ЧГ=0")		+ ";  " + 
										"ШК: "				+ Формат(Число(СтрокаТЧ.Штрихкод),"ЧЦ=13; ЧВН=; ЧГ=0") 	+ ";  " +
										"Цена: "			+ Формат(СтрокаТЧ.Цена,"ЧДЦ=2; ЧРД=,; ЧН=")	 			+ ";  " +
										"Сумма: "			+ Формат(СтрокаТЧ.Сумма,"ЧДЦ=2; ЧРД=,; ЧН=") 			+ ";  " +
										"СкидкаСумма: "		+ Формат(СтрокаТЧ.СкидкаСумма,"ЧДЦ=2; ЧРД=,; ЧН=")		+ ";  " +
										"СкидкаПС: "		+ Формат(СтрокаТЧ.СкидкаПС,"ЧДЦ=2; ЧРД=,; ЧН=") 		+ ";  " +
										"СкидкаБК: "		+ Формат(СтрокаТЧ.СкидкаБК,"ЧДЦ=2; ЧРД=,; ЧН=") 		+ ";  " +
										//"НомАкции: "		+ СтрокаТЧ.НомерАкции									+ ";  " +
										"DATASTR2: "		+ СтрокаТЧ.DATASTR2 									+ ";  " +
										"НДС: "				+ СтрокаТЧ.СтавкаНДС 									+ ";  " +
										"Кол-во: "			+ СтрокаТЧ.Количество									+ ";  " +                                        
										"НомерZОтчета: "	+ СтрокаТЧ.НомерZОтчета									+ ";  " +
										"Кассир: "			+ СтрокаТЧ.Кассир 										+ ";  " +
										"Касса: "			+ СтрокаТЧ.Касса										;// +
										//"ДатаВремяСтроки: "	+ СтрокаТЧ.ДатаВремяСтроки    							+ ";  " +
										//"ВидОплаты: "		+ СтрокаТЧ.ВидОплаты    								+ ";  " +
										//"ВидОперации: "		+ СтрокаТЧ.ВидОперации;
        ЗаписьЖурналаРегистрации(пВидСобытия, пУровеньРегистрации, пМетаданные,, пКомментарий1,);	
		Если НЕ ПустаяСтрока(пКомментарий) Тогда 
			ЗаписьЖурналаРегистрации(пВидСобытия, пУровеньРегистрации, пМетаданные,, пКомментарий,);
		КонецЕсли;

	ИначеЕсли ТЧ<>Неопределено Тогда
		СуммаЧека					= ТЧ.Итог("Сумма")-ТЧ.Итог("СкидкаПС")-ТЧ.Итог("СкидкаБК");
		Для Каждого СтрокаТЧ из ТЧ Цикл 
			пКомментарий1 			= 	пПроцедура			+ Символы.ПС                                            +
										"Чек№: "			+ (Константы.глСчетчикЧеков.Получить()+1)				+ ";  " + 
										"СуммаЧека: "		+ Формат(СуммаЧека,"ЧДЦ=2; ЧРД=,; ЧН=")					+ ";  " +
										"Строка№: "			+ СтрокаТЧ.НомерСтроки 									+ ";  " + 
										//"Ануляция: "		+ СтрокаТЧ.Ануляция 									+ ";  " + 
										"Код: "				+ Формат(Число(СтрокаТЧ.Код),"ЧЦ=6; ЧВН=; ЧГ=0")		+ ";  " + 
										"ШК: "				+ Формат(Число(СтрокаТЧ.Штрихкод),"ЧЦ=13; ЧВН=; ЧГ=0") 	+ ";  " +
										"Цена: "			+ Формат(СтрокаТЧ.Цена,"ЧДЦ=2; ЧРД=,; ЧН=")	 			+ ";  " +
										"Сумма: "			+ Формат(СтрокаТЧ.Сумма,"ЧДЦ=2; ЧРД=,; ЧН=") 			+ ";  " +
										"СкидкаСумма: "		+ Формат(СтрокаТЧ.СкидкаСумма,"ЧДЦ=2; ЧРД=,; ЧН=")		+ ";  " +
										"СкидкаПС: "		+ Формат(СтрокаТЧ.СкидкаПС,"ЧДЦ=2; ЧРД=,; ЧН=") 		+ ";  " +
										"СкидкаБК: "		+ Формат(СтрокаТЧ.СкидкаБК,"ЧДЦ=2; ЧРД=,; ЧН=") 		+ ";  " +
										"НомАкции: "		+ СтрокаТЧ.НомерАкции									+ ";  " +
										"DATASTR2: "		+ СтрокаТЧ.DATASTR2 									+ ";  " +
										"НДС: "				+ СтрокаТЧ.СтавкаНДС 									+ ";  " +
										"Кол-во: "			+ СтрокаТЧ.Количество									+ ";  " +
                                        "НомерZОтчета: "	+ СтрокаТЧ.НомерZОтчета									+ ";  " +
										"Кассир: "			+ СтрокаТЧ.Кассир 										+ ";  " +
										"Касса: "			+ СтрокаТЧ.Касса										+ ";  " +
										"ДатаВремяСтроки: "	+ СтрокаТЧ.ДатаВремяСтроки    							+ ";  " +
										"ВидОплаты: "		+ СтрокаТЧ.ВидОплаты    								+ ";  " +
										"ВидОперации: "		+ СтрокаТЧ.ВидОперации;
            ЗаписьЖурналаРегистрации(пВидСобытия, пУровеньРегистрации, пМетаданные,, пКомментарий1,);
		КонецЦикла;	
		Если НЕ ПустаяСтрока(пКомментарий) Тогда 
			ЗаписьЖурналаРегистрации(пВидСобытия, пУровеньРегистрации, пМетаданные,, пКомментарий,);
		КонецЕсли;
	ИначеЕсли пКомментарий<>Неопределено Тогда 
		пКомментарий				= пКомментарий + Символы.ПС + "Чек№: "+ (Константы.глСчетчикЧеков.Получить()+1) + ";  "; 
		ЗаписьЖурналаРегистрации(пВидСобытия, пУровеньРегистрации, пМетаданные,, пПроцедура+Символы.Таб+пКомментарий,);	 
	КонецЕсли;	
	
	
КонецПроцедуры	
