////////////////////////////////////////////////////////////////////
//			ОПИСАНИЕ ОШИБКИ !!!                                   //

// Получение информации о текущем состоянии ЭККР 	///////////////
Функция СтатусРегистратора(пЭККР)
 	Возврат пЭККР.GetByteStatus;
КонецФункции
 	
// Получение кода ошибки ЭККР 						///////////////
Функция Результат(пЭККР)
	Возврат пЭККР.GetByteResult;
КонецФункции

// Получение текстовой информации об ошибке ЭККР 	///////////////
Функция СообщениеОбОшибке(пЭККР)
	Возврат пЭККР.GetTextErrorMessage;
КонецФункции

Функция  ОшибкаФР_Сообщить(Результат)
	ТекстОшибки         											= "";
	k																= СокрЛП(Результат);
	
	Если k="0"  		Тогда  							ТекстОшибки	= "" 		//Без ошибок Возврат Истина; 	
	ИначеЕсли k="-1" 	Тогда  							ТекстОшибки	= "Общая ошибка";
	ИначеЕсли k="-2" 	Тогда  							ТекстОшибки	= "Нет лицензии на кассу";
	ИначеЕсли k="-3" 	Тогда  							ТекстОшибки	= "Аппарат получил неправильный блок или CRC";		
	ИначеЕсли k="-4" 	Тогда   						ТекстОшибки	= "При чтении блока вычисленный неправ. CRC";	
	ИначеЕсли k="-5" 	Тогда   						ТекстОшибки	= "Нет начала блока - скорее всего нет связи (скорость, кабель)";
	ИначеЕсли k="-6" 	Тогда   						ТекстОшибки	= "Ошибочный байт начала блока";
	ИначеЕсли k="-7" 	Тогда   						ТекстОшибки	= "Данная возможность не доступна";
	ИначеЕсли k="-8" 	Тогда  	 						ТекстОшибки	= "В принятом блоке нет символа конца данных 04h";
	ИначеЕсли k="-9" 	Тогда   						ТекстОшибки	= "В принятом блоке нет символа 03h или 05h";
	ИначеЕсли k="-10"	Тогда   						ТекстОшибки	= "Неправильная длина принятого блока (>137 или <16)";
	ИначеЕсли k="-14"	Тогда   						ТекстОшибки	= "Ошибочные входные данные ф-ии";
/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////		
/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////		
   	ИначеЕсли (k="$0000") или (k="0000")	Тогда   	ТекстОшибки	= "";     	//Без ошибок  Возврат Истина; 
		//0xXX01 Ошибки оборудования
  	ИначеЕсли (k="$0101") или (k="257")		Тогда  		ТекстОшибки	= "$0101 Ошибка принтера";
	ИначеЕсли (k="$0201") или (k="513")		Тогда  		ТекстОшибки	= "$0201 Ошибка RAM";
	ИначеЕсли (k="$0301") или (k="769")		Тогда  		ТекстОшибки	= "$0301 Ошибка Контрольная сумма памяти программ";
	ИначеЕсли (k="$0401") или (k="1025")	Тогда  		ТекстОшибки	= "$0401 Ошибка flash памяти";
	ИначеЕсли (k="$0501") или (k="1281")	Тогда  		ТекстОшибки	= "$0501 Ошибка Дисплея";
	ИначеЕсли (k="$0601") или (k="1537")	Тогда  		ТекстОшибки	= "$0601 Ошибка часов";
	ИначеЕсли (k="$0701") или (k="1793")	Тогда  		ТекстОшибки	= "$0701 Ошибка возникла вследствие понижения питания";
	ИначеЕсли (k="$0002") или (k="2") 		Тогда  		ТекстОшибки	= "$0002 Неправильный код инструкции";
		//0xNN03	Формат поля неверен, где NN -Порядковый номер неверного поля	                                                                     
	ИначеЕсли ПРАВ(k,2)="03"				Тогда  		ТекстОшибки	= "Формат поля неверен, где NN -Порядковый номер неверного поля ("+ ЛЕВ(k,2)+")";
		 //0xNN04	Значение поля выходит за диапазон, где NN -Порядковый номер неверного поля          
	ИначеЕсли ПРАВ(k,2)="04"				Тогда  		ТекстОшибки	= "Значение поля выходит за диапазон, где NN -Порядковый номер неверного поля ("+ ЛЕВ(k,2) +")";
		//0xXX05 Ошибка ФП     
	ИначеЕсли (k="$0005")	или (k="5") 	Тогда  		ТекстОшибки	= "$0005 Нет свободного места для записи";
	ИначеЕсли (k="$0105")	или (k="261") 	Тогда  		ТекстОшибки	= "$0105 Ошибка записи в ФП";
	ИначеЕсли (k="$0205")	или (k="517") 	Тогда  		ТекстОшибки	= "$0205 Заводской номер неустановлен";
	ИначеЕсли (k="$0305")	или (k="773") 	Тогда  		ТекстОшибки	= "$0305 Дата последней записи в ФП более поздняя, чем та, что пытаемся установить";
	ИначеЕсли (k="$0405")	или (k="1029")	Тогда  		ТекстОшибки	= "$0405 Нельзя выходить за пределы суток";
	ИначеЕсли (k="$0505")	или (k="1285")	Тогда 	 	ТекстОшибки	= "$0505 Сбой данных в ФП";
	ИначеЕсли (k="$0605")	или (k="1541")	Тогда  		ТекстОшибки	= "$0605 фискальная память исчерпана(Запись запрещена)";
	ИначеЕсли (k="$0705")	или (k="1797")	Тогда  		ТекстОшибки	= "$0705 ЭККР не в фискальном режиме";
	ИначеЕсли (k="$0805")	или (k="2053")	Тогда 	 	ТекстОшибки	= "$0805 дата и время не были установлены с момента последнего аварийного обнуления ОЗУ";
	ИначеЕсли (k="$0905") 	или (k="2309")	Тогда  		ТекстОшибки	= "$0905 С начала смены прошло более чем 24 часа";
	ИначеЕсли (k="$0A05")	или (k="2565")	Тогда  		ТекстОшибки	= "$0A05 необходимо скорректировать время";
	ИначеЕсли (k="$0B05")	или (k="2821") 	Тогда  		ТекстОшибки	= "$0B05 Ошибка в таблице налоговых ставок";
	ИначеЕсли (k="$0006")	или (k="6") 	Тогда  		ТекстОшибки	= "$0006 Неверный пароль";
		 //0xXX07 ошибка режима
	ИначеЕсли (k="$0007")	или (k="7") 	Тогда  		ТекстОшибки	= "$0007 Команда в данном режиме регистратора невыполнима";
	ИначеЕсли (k="$0107")	или (k="263") 	Тогда  		ТекстОшибки	= "$0107 Команда в данном состоянии смены невыполнима";
	ИначеЕсли (k="$0008")	или (k="8") 	Тогда 		ТекстОшибки	= "$0008 Переполнение математики";
	ИначеЕсли (k="$0009")	или (k="9") 	Тогда  		ТекстОшибки	= "$0009 Не обнулено";
		 //0xXX0A Ошибки при работе с базой товаров
	ИначеЕсли (k="$000A")	или (k="10")	Тогда  		ТекстОшибки	= "$000A Недостаточно свободного места для выполнения команды";
	ИначеЕсли (k="$010A")	или (k="266")  	Тогда  		ТекстОшибки	= "$010A Длинна записи больше максимума";
	ИначеЕсли (k="$020A")	или (k="522")  	Тогда  		ТекстОшибки	= "$020A Артикул с данным кодом не найден";
	ИначеЕсли (k="$030A")	или (k="778")  	Тогда  		ТекстОшибки	= "$030A Индекс за пределами базы";
	ИначеЕсли (k="$040A")	или (k="1034")  Тогда  		ТекстОшибки	= "$040A Артикул/отдел с данным кодом существует";
	ИначеЕсли (k="$050A")	или (k="1290")  Тогда  		ТекстОшибки	= "$050A Запрещенная налоговая группа";
		 //0хХX0B Ошибка при работе с цепочкой продаж                                                     //
	ИначеЕсли (k="$000B")	или (k="11") 	Тогда  		ТекстОшибки	= "$000B Неверное состояние документа";
	ИначеЕсли (k="$010B")	или (k="267") 	Тогда  		ТекстОшибки	= "$010B Недостаточно свободного места для выполнения команды";
	ИначеЕсли (k="$020B")	или (k="523") 	Тогда  		ТекстОшибки	= "$020BНеизвестный тип записи продажи";
	ИначеЕсли (k="$030B")	или (k="779") 	Тогда  		ТекстОшибки	= "$030B Аннулирование не может начинаться с данной операции";
	ИначеЕсли (k="$040B")	или (k="1035") 	Тогда  		ТекстОшибки	= "$040B Данная операция в чеке не найдена";
	ИначеЕсли (k="$050B")	или (k="1291") 	Тогда  		ТекстОшибки	= "$050B последовательность неполная (за последней операцией есть еще команды которые с ней связаны)";
	ИначеЕсли (k="$060B")	или (k="1547") 	Тогда  		ТекстОшибки	= "$060B Аннулировать нечего";
	ИначеЕсли (k="$070B")	или (k="1803") 	Тогда  		ТекстОшибки	= "$070B Копия чека недоступна";
	ИначеЕсли (k="$080B")	или (k="2059") 	Тогда  		ТекстОшибки	= "$080B Недостаточно наличности для выполнения операции";
	ИначеЕсли (k="$090B")	или (k="2315") 	Тогда  		ТекстОшибки	= "$090B Данная форма оплаты в этом чеке запрещена";
	ИначеЕсли (k="$0A0B")	или (k="2571") 	Тогда 		ТекстОшибки	= "$0A0B Данная сдача с данной формы оплаты (в данном типе чека) запрещена";
	ИначеЕсли (k="$0B0B")	или (k="2827") 	Тогда  		ТекстОшибки	= "$0B0B Значение скидки вышло за пределы";
	ИначеЕсли (k="$0C0B")	или (k="3083") 	Тогда  		ТекстОшибки	= "$0C0B Переполнение итога по чеку";
	ИначеЕсли (k="$0D0B")	или (k="3339") 	Тогда  		ТекстОшибки	= "$0D0B Переполнение по оплатам";
	ИначеЕсли (k="$0E0B")	или (k="3595") 	Тогда 		ТекстОшибки	= "$0E0B Вышли за пределы буфера";
	ИначеЕсли (k="$000C")	или (k="12") 	Тогда  		ТекстОшибки	= "$000C Ошибки временного буфера";
	ИначеЕсли (k="$010C")	или (k="268") 	Тогда  		ТекстОшибки	= "$010C Данные не совпали с ранее сохраненными";	
	ИначеЕсли k="" Тогда                           		ТекстОшибки	= "<ПустаяСтрока> - результата выполнения команды на ФР";
	Иначе                                               ТекстОшибки	= "<"+k+"> - результата выполнения команды на ФР";
	КонецЕсли;	
	
	Если ПустаяСтрока(ТекстОшибки) Тогда 
		Возврат Ложь
	Иначе 	
		Логирование.ДобавитьЗаписьЖурнала(УровеньЖурналаРегистрации.Ошибка, "ОшибкаСообщить().ОШИБКА_ФР", ТекстОшибки, Неопределено, Неопределено, "Обработки.ТО_Datecs_FP_3530T");
		Предупреждение(ТекстОшибки,,"ОШИБКА ПРИ ВЫПОЛНЕНИИ КОМАНДЫ НА ФР !!!");
		Возврат Истина
	КонецЕсли;
	
КонецФункции	
//		                                                          //
////////////////////////////////////////////////////////////////////



Функция ОткрытьПорт() Экспорт
	
	ТО_ФР.ПараметрыФР_Очистить();
	
	пЭККР                                                                  	= ПараметрыФР.ФР_Объект;
	пМодем                                                                 	= ПараметрыФР.ФР_ОбъектМодем;	

	Если пЭККР = Неопределено Тогда //Мулько
		пЭККР																= Новый COMОбъект("FP3141.FiscPrn");	
	КонецЕсли;	

	Попытка
		Результат 																= пЭККР.SETCOMPORT(Число(ПараметрыФР.ФР_Порт), Число(ПараметрыФР.ФР_Скорость));
		КодОшибки																= пЭККР.PORTOK();
	Исключение
		Возврат ЗакрытьПорт();
	КонецПопытки;
	
	Если КодОшибки<>0 Тогда 
		Предупреждение("Код ошибки установки порта СОМ" + ПараметрыФР.ФР_Порт + "@" + ПараметрыФР.ФР_Скорость + ": " + КодОшибки);
		Возврат ЗакрытьПорт();
	КонецЕсли;
		
	ПараметрыФР.ФР_Объект													= пЭККР;
	
	Возврат пЭККР;
КонецФункции	 

Функция ЗакрытьПорт() Экспорт 
	
	Если ПараметрыФР = Неопределено Тогда //Мулько
		пЭККР																= Новый COMОбъект("FP3141.FiscPrn");	
	Иначе
		Если ПараметрыФР.ФР_Объект = Неопределено Тогда
			пЭККР = Новый COMОбъект("FP3141.FiscPrn");	
		Иначе	
			пЭККР                                                           = ПараметрыФР.ФР_Объект;
		КонецЕсли;		
	КонецЕсли;	
	
	Попытка
		Результат 															= пЭККР.CLOSECOMPORT();
	Исключение		
	КонецПопытки;
	
	ТО_ФР.ПараметрыФР_Очистить();
	
	Возврат Неопределено;
	
КонецФункции

Функция ПроверитьПодключениеФР() Экспорт 
	
	пЭККР = ПараметрыФР.ФР_Объект;
	
	Если пЭККР = Неопределено Тогда Возврат Ложь	КонецЕсли;
																				
	СерийныйНомерФР = СокрЛП(ПолучитьСерийныйНомер()); 	
	Если СерийныйНомерФР<>СокрЛП(Константы.осн_КассаККМ.Получить()) Тогда		Возврат	Ложь    КонецЕсли;
	
	ДатаФР = ПолучитьДатуВремяФР();
	Если НачалоДня(ТекущаяДата()) <> НачалоДня(ДатаФР) Тогда 					Возврат	Ложь	КонецЕсли; 
	
	Если ОшибкаФР_Сообщить(СокрЛП(пЭККР.GETERROR)) Тогда                    Возврат Ложь;	КонецЕсли;
	
	Возврат Истина;
КонецФункции

Функция ОборотыФР_Z_Отчет(Рез_ОборотыФР) Экспорт
	
	Попытка
		
		пЭККР = ПараметрыФР.ФР_Объект;
		
		Рез_ОборотыФР.ФР_Номер_Z_Отчета 						= Число(пЭККР.COUNTERSDAY(0,"000000"));
		//Рез_ОборотыФР.ФР_ДатаПоследнегоОтчета					= пЭККР.GetLastDateZReport;
		Рез_ОборотыФР.ФР_СерийныйНомер 							= пЭККР.ZNUM("000000");
		Рез_ОборотыФР.ФР_ФискальныйНомер 						= пЭККР.FNUM("000000");
		
		Рез_ОборотыФР.ФР_ОборотиПродаж_БезНал					= Число(пЭККР.SUMDAY(2,3,0,1,"000000"));
		Рез_ОборотыФР.ФР_ОборотиПродаж_Нал						= Число(пЭККР.SUMDAY(2,0,0,1,"000000"));
		Рез_ОборотыФР.ФР_ОборотиПродаж_ПС						= Число(пЭККР.SUMDAY(2,4,0,1,"000000"));
		Рез_ОборотыФР.ФР_ОборотиПродаж_Ваучер					= Число(пЭККР.SUMDAY(2,5,0,1,"000000"));		
		
		Рез_ОборотыФР.ФР_ОборотиВозвратов_БезНал				= (-1) * Число(пЭККР.SUMDAY(2,3,0,2,"000000"));
		Рез_ОборотыФР.ФР_ОборотиВозвратов_Нал					= (-1) * Число(пЭККР.SUMDAY(2,0,0,2,"000000"));
		Рез_ОборотыФР.ФР_ОборотиВозвратов_ПС					= (-1) * Число(пЭККР.SUMDAY(2,4,0,2,"000000"));
		Рез_ОборотыФР.ФР_ОборотиВозвратов_Ваучер				= (-1) * Число(пЭККР.SUMDAY(2,5,0,2,"000000"));		

		Рез_ОборотыФР.ФР_ОборотиПродаж							= Рез_ОборотыФР.ФР_ОборотиПродаж_БезНал+Рез_ОборотыФР.ФР_ОборотиПродаж_Нал+Рез_ОборотыФР.ФР_ОборотиПродаж_ПС+Рез_ОборотыФР.ФР_ОборотиПродаж_Ваучер;
		Рез_ОборотыФР.ФР_ОборотиВозвратов						= Рез_ОборотыФР.ФР_ОборотиВозвратов_БезНал+Рез_ОборотыФР.ФР_ОборотиВозвратов_Нал+Рез_ОборотыФР.ФР_ОборотиВозвратов_ПС+Рез_ОборотыФР.ФР_ОборотиВозвратов_Ваучер;

		Рез_ОборотыФР.ФР_КоличествоЧеков_Продажа 				= Число(пЭККР.COUNTERSDAY(1,"000000"));
		Рез_ОборотыФР.ФР_КоличествоЧеков_Возврат 				= Число(пЭККР.COUNTERSDAY(2,"000000"));
		Рез_ОборотыФР.ФР_КоличествоАннулированныхЧеков_Продажа 	= 0;
		Рез_ОборотыФР.ФР_КоличествоАннулированныхЧеков_Возврат 	= 0;
		
		Рез_ОборотыФР.ФР_ОборотПродаж_А							= Число(пЭККР.SUMDAY(0,0,0,1,"000000"));
		Рез_ОборотыФР.ФР_ОборотПродаж_Б							= Число(пЭККР.SUMDAY(0,1,0,1,"000000"));
		Рез_ОборотыФР.ФР_ОборотПродаж_В							= Число(пЭККР.SUMDAY(0,2,0,1,"000000"));
		Рез_ОборотыФР.ФР_ОборотПродаж_Г							= Число(пЭККР.SUMDAY(0,3,0,1,"000000"));
		Рез_ОборотыФР.ФР_ОборотПродаж_Д							= Число(пЭККР.SUMDAY(0,4,0,1,"000000"));
		Рез_ОборотыФР.ФР_ОборотПродаж_Е							= 0;
		
		Рез_ОборотыФР.ФР_ОборотВозврат_А						= (-1) * Число(пЭККР.SUMDAY(0,0,0,2,"000000"));
		Рез_ОборотыФР.ФР_ОборотВозврат_Б						= (-1) * Число(пЭККР.SUMDAY(0,1,0,2,"000000"));
		Рез_ОборотыФР.ФР_ОборотВозврат_В						= (-1) * Число(пЭККР.SUMDAY(0,2,0,2,"000000"));
		Рез_ОборотыФР.ФР_ОборотВозврат_Г						= (-1) * Число(пЭККР.SUMDAY(0,3,0,2,"000000"));
		Рез_ОборотыФР.ФР_ОборотВозврат_Д						= (-1) * Число(пЭККР.SUMDAY(0,4,0,2,"000000"));
		Рез_ОборотыФР.ФР_ОборотВозврат_Е						= 0;
		
		
		
		Рез_ОборотыФР.ФР_НДСПродаж_А							= Число(пЭККР.SUMDAY(1,0,0,1,"000000"));
		Рез_ОборотыФР.ФР_НДСПродаж_Б							= Число(пЭККР.SUMDAY(1,1,0,1,"000000"));
		Рез_ОборотыФР.ФР_НДСПродаж_В							= Число(пЭККР.SUMDAY(1,2,0,1,"000000"));
		Рез_ОборотыФР.ФР_НДСПродаж_Г							= Число(пЭККР.SUMDAY(1,3,0,1,"000000"));
		Рез_ОборотыФР.ФР_НДСПродаж_Д							= Число(пЭККР.SUMDAY(1,4,0,1,"000000"));
		Рез_ОборотыФР.ФР_НДСПродаж_Е							= 0;
		
		Рез_ОборотыФР.ФР_НДСВозврат_А							= (-1) * Число(пЭККР.SUMDAY(1,0,0,2,"000000"));
		Рез_ОборотыФР.ФР_НДСВозврат_Б							= (-1) * Число(пЭККР.SUMDAY(1,1,0,2,"000000"));
		Рез_ОборотыФР.ФР_НДСВозврат_В							= (-1) * Число(пЭККР.SUMDAY(1,2,0,2,"000000"));
		Рез_ОборотыФР.ФР_НДСВозврат_Г							= (-1) * Число(пЭККР.SUMDAY(1,3,0,2,"000000"));
		Рез_ОборотыФР.ФР_НДСВозврат_Д							= (-1) * Число(пЭККР.SUMDAY(1,4,0,2,"000000"));
		Рез_ОборотыФР.ФР_НДСВозврат_Е							= 0;
		
		
		
		Рез_ОборотыФР.ФР_СтавкаНалога_А							= Число(пЭККР.READTAXRATE(0,2,"000000"));
		Рез_ОборотыФР.ФР_СтавкаНалога_Б							= Число(пЭККР.READTAXRATE(1,2,"000000"));
		Рез_ОборотыФР.ФР_СтавкаНалога_В							= Число(пЭККР.READTAXRATE(2,2,"000000"));
		Рез_ОборотыФР.ФР_СтавкаНалога_Г							= Число(пЭККР.READTAXRATE(3,2,"000000"));
		Рез_ОборотыФР.ФР_СтавкаНалога_Д							= Число(пЭККР.READTAXRATE(4,2,"000000"));
		Рез_ОборотыФР.ФР_СтавкаНалога_Е							= 0;
		
		Рез_ОборотыФР.ФР_СуммаВнесение							= Число(пЭККР.SUMDAY(3,1,0,1,"000000"));
		Рез_ОборотыФР.ФР_СуммаИзъятие							= Число(пЭККР.SUMDAY(3,1,0,2,"000000"))*(-1);
		
		Рез_ОборотыФР.ФР_СуммаСкидокПродажа						= 0;
		Рез_ОборотыФР.ФР_СуммаСкидокВозврат						= 0;
		
		Рез_ОборотыФР.ФР_СуммаВСейфе							= Рез_ОборотыФР.ФР_ОборотиПродаж_Нал - Рез_ОборотыФР.ФР_ОборотиВозвратов_Нал
																 + Рез_ОборотыФР.ФР_СуммаВнесение - Рез_ОборотыФР.ФР_СуммаИзъятие;
																	 
		Рез_ОборотыФР.Результат = Истина;
		
	Исключение
	КонецПопытки;	
	
	Возврат Рез_ОборотыФР;

КонецФункции	
 
Функция ОборотыФР (пЭККР) Экспорт
	Рез_ОборотыФР															= Новый Структура;
	Рез_ОборотыФР.Вставить("Результат", 						Ложь);
	Рез_ОборотыФР.Вставить("ФР_ОборотиПродаж", 				0);
	Рез_ОборотыФР.Вставить("ФР_ОборотиПродаж_БезНал", 		0);
   	Рез_ОборотыФР.Вставить("ФР_ОборотиПродаж_Нал", 			0);
	Рез_ОборотыФР.Вставить("ФР_ОборотиПродаж_ПС", 			0);
	Рез_ОборотыФР.Вставить("ФР_ОборотиПродаж_Ваучер",		0);
	Рез_ОборотыФР.Вставить("ФР_ОборотиВозвратов", 			0);
	Рез_ОборотыФР.Вставить("ФР_ОборотиВозвратов_БезНал", 	0);
   	Рез_ОборотыФР.Вставить("ФР_ОборотиВозвратов_Нал", 		0);
	Рез_ОборотыФР.Вставить("ФР_ОборотиВозвратов_ПС", 		0);
	Рез_ОборотыФР.Вставить("ФР_ОборотиВозвратов_Ваучер", 	0);
	Рез_ОборотыФР.Вставить("ФР_СуммаВыручки_Нал", 			0); //Только для ФР МИНИ
	Рез_ОборотыФР.Вставить("ФР_СуммаВыручки_БезНал", 		0); //Только для ФР МИНИ
	Рез_ОборотыФР.Вставить("ФР_СуммаВыручки_ПС", 			0); //Только для ФР МИНИ
	Рез_ОборотыФР.Вставить("ФР_СуммаВыручки_Ваучер", 		0); //Только для ФР МИНИ


	Попытка
		//Строка_ФР_СлужебноеВнесение						= пЭККР.SUMDAY(3,1,0,1,"000000");
		//Строка_ФР_СлужебноеИзьятие						= пЭККР.SUMDAY(3,1,0,2,"000000");
		//
		//  Строка_ФР_КолЧековПродаж						= пЭККР.COUNTERSDAY(1,"000000");
		//Строка_ФР_ОборотиПродаж_А						= пЭККР.SUMDAY(0,0,0,1,"000000");
		//Строка_ФР_ОборотиПродаж_Б						= пЭККР.SUMDAY(0,1,0,1,"000000");
		//Строка_ФР_ОборотиПродаж_В						= пЭККР.SUMDAY(0,2,0,1,"000000");
    	Строка_ФР_ОборотиПродаж_БезНал					= пЭККР.SUMDAY(2,3,0,1,"000000");
    	Строка_ФР_ОборотиПродаж_Нал						= пЭККР.SUMDAY(2,0,0,1,"000000");
    	Строка_ФР_ОборотиПродаж_ПС						= пЭККР.SUMDAY(2,4,0,1,"000000");
    	Строка_ФР_ОборотиПродаж_Ваучер					= пЭККР.SUMDAY(2,5,0,1,"000000");

			
		//Строка_ФР_КолЧековВозвратов						= пЭККР.COUNTERSDAY(2,"000000");
		//Строка_ФР_ОборотиВозвратов_А					= пЭККР.SUMDAY(0,0,0,2,"000000");
		//Строка_ФР_ОборотиВозвратов_Б					= пЭККР.SUMDAY(0,1,0,2,"000000");
		//Строка_ФР_ОборотиВозвратов_В					= пЭККР.SUMDAY(0,2,0,2,"000000");
    	Строка_ФР_ОборотиВозвратов_БезНал				= пЭККР.SUMDAY(2,3,0,2,"000000");
    	Строка_ФР_ОборотиВозвратов_Нал					= пЭККР.SUMDAY(2,0,0,2,"000000");
		Строка_ФР_ОборотиВозвратов_ПС					= пЭККР.SUMDAY(2,4,0,2,"000000");
    	Строка_ФР_ОборотиВозвратов_Ваучер				= пЭККР.SUMDAY(2,5,0,2,"000000");

		Рез_ОборотыФР.ФР_ОборотиПродаж_БезНал			= ?(ПустаяСтрока(Строка_ФР_ОборотиПродаж_БезНал), 			0, Число(Строка_ФР_ОборотиПродаж_БезНал));
		Рез_ОборотыФР.ФР_ОборотиПродаж_Нал				= ?(ПустаяСтрока(Строка_ФР_ОборотиПродаж_Нал), 				0, Число(Строка_ФР_ОборотиПродаж_Нал));
		Рез_ОборотыФР.ФР_ОборотиПродаж_ПС				= ?(ПустаяСтрока(Строка_ФР_ОборотиПродаж_ПС), 				0, Число(Строка_ФР_ОборотиПродаж_ПС));
		Рез_ОборотыФР.ФР_ОборотиПродаж_Ваучер			= ?(ПустаяСтрока(Строка_ФР_ОборотиПродаж_Ваучер), 			0, Число(Строка_ФР_ОборотиПродаж_Ваучер));

		
		Рез_ОборотыФР.ФР_ОборотиВозвратов_БезНал		= ?(ПустаяСтрока(Строка_ФР_ОборотиВозвратов_БезНал), 		0, Число(Строка_ФР_ОборотиВозвратов_БезНал));
		Рез_ОборотыФР.ФР_ОборотиВозвратов_Нал			= ?(ПустаяСтрока(Строка_ФР_ОборотиВозвратов_Нал),			0, Число(Строка_ФР_ОборотиВозвратов_Нал));	
		Рез_ОборотыФР.ФР_ОборотиВозвратов_ПС			= ?(ПустаяСтрока(Строка_ФР_ОборотиВозвратов_ПС), 			0, Число(Строка_ФР_ОборотиВозвратов_ПС));
		Рез_ОборотыФР.ФР_ОборотиВозвратов_Ваучер		= ?(ПустаяСтрока(Строка_ФР_ОборотиВозвратов_Ваучер),		0, Число(Строка_ФР_ОборотиВозвратов_Ваучер));
		
		Рез_ОборотыФР.ФР_ОборотиВозвратов_БезНал		= ?(Рез_ОборотыФР.ФР_ОборотиВозвратов_БезНал<0,			 	Рез_ОборотыФР.ФР_ОборотиВозвратов_БезНал*(-1), 			Рез_ОборотыФР.ФР_ОборотиВозвратов_БезНал);
		Рез_ОборотыФР.ФР_ОборотиВозвратов_Нал			= ?(Рез_ОборотыФР.ФР_ОборотиВозвратов_Нал<0,				Рез_ОборотыФР.ФР_ОборотиВозвратов_Нал*(-1), 			Рез_ОборотыФР.ФР_ОборотиВозвратов_Нал);
		Рез_ОборотыФР.ФР_ОборотиВозвратов_ПС			= ?(Рез_ОборотыФР.ФР_ОборотиВозвратов_ПС<0,			 		Рез_ОборотыФР.ФР_ОборотиВозвратов_ПС*(-1), 				Рез_ОборотыФР.ФР_ОборотиВозвратов_ПС);
		Рез_ОборотыФР.ФР_ОборотиВозвратов_Ваучер		= ?(Рез_ОборотыФР.ФР_ОборотиВозвратов_Ваучер<0,				Рез_ОборотыФР.ФР_ОборотиВозвратов_Ваучер*(-1), 			Рез_ОборотыФР.ФР_ОборотиВозвратов_Ваучер);

		
		Рез_ОборотыФР.ФР_ОборотиПродаж					= Рез_ОборотыФР.ФР_ОборотиПродаж_БезНал+Рез_ОборотыФР.ФР_ОборотиПродаж_Нал+Рез_ОборотыФР.ФР_ОборотиПродаж_ПС+Рез_ОборотыФР.ФР_ОборотиПродаж_Ваучер;
		Рез_ОборотыФР.ФР_ОборотиВозвратов				= Рез_ОборотыФР.ФР_ОборотиВозвратов_БезНал+Рез_ОборотыФР.ФР_ОборотиВозвратов_Нал+Рез_ОборотыФР.ФР_ОборотиВозвратов_ПС+Рез_ОборотыФР.ФР_ОборотиВозвратов_Ваучер;

		Рез_ОборотыФР.Результат							= Истина;
	Исключение
	КонецПопытки;	
	
	Возврат Рез_ОборотыФР
КонецФункции	



функция УстановитьОператора() экспорт
	пЭККР																	= ПараметрыФР.ФР_Объект;

	Кассир  																= Лев(СокрЛП(глТекущийПользователь), 15);
	Результат 																= пЭККР.SETOPER(1, "000000", Кассир, "000000");
	Возврат Результат;
Конецфункции	

Функция ПолучитьДатуВремяФР() Экспорт
	пЭККР																	= ПараметрыФР.ФР_Объект;
	ПараметрыФР.ФР_ДатаВеремяНаФР											= Дата(1,1,1);

	Попытка
		СтрокаДата 															= пЭККР.RETDT(1,"000000");
		СтрокаВремя 														= пЭККР.RETDT(0,"000000");
		ПараметрыФР.ФР_ДатаВеремяНаФР 										=  ДатаИзПредставленияДМГЧМС(СтрокаДата,СтрокаВремя);
	Исключение
		ПараметрыФР.ФР_ДатаВеремяНаФР										= Дата(1,1,1); // ошибка
	КонецПопытки;
	
	Возврат ПараметрыФР.ФР_ДатаВеремяНаФР;
КонецФункции

Функция ДатаИзПредставленияДМГЧМС(СтрокаДата,СтрокаВремя)
	//СтрокаВремя 	= СтрЗаменить(СтрокаВремя, ":",Символы.ПС);
	//СтрокаДата 		= СтрЗаменить(СтрокаДата, ".",Символы.ПС);
    Р 				= "20" + Прав(СтрокаДата, 2)+ Символы.ПС + Сред(СтрокаДата, 3, 2) 	+ Символы.ПС + Лев(СтрокаДата,2) + Символы.ПС;
	Р 				= Р + Лев(СтрокаВремя, 2)	+ Символы.ПС + Прав(СтрокаВремя, 2)		+ Символы.ПС + "00";
	    
    Возврат 
        Дата(
        Формат(Число(СтрПолучитьСтроку(р,1)),"ЧЦ=4; ЧН=0000; ЧВН=; ЧГ=") +
        Формат(Число(СтрПолучитьСтроку(р,2)),"ЧЦ=2; ЧН=00; ЧГ=; ЧВН=") +
        Формат(Число(СтрПолучитьСтроку(р,3)),"ЧЦ=2; ЧН=00; ЧВН=") +
        Формат(Число(СтрПолучитьСтроку(р,4)),"ЧЦ=2; ЧН=00; ЧВН=") +
        Формат(Число(СтрПолучитьСтроку(р,5)),"ЧЦ=2; ЧН=00; ЧГ=; ЧВН=") +
        Формат(Число(СтрПолучитьСтроку(р,6)),"ЧЦ=2; ЧН=00; ЧГ=; ЧВН=") 
        );


КонецФункции

Функция ПолучитьСерийныйНомер() Экспорт
	// Серийный номер выдаеться заводом. 
	// Уникальность контролируеться каждым заводом. 
	// Длина разная (10, 11, 12 символов).

	пЭККР																	= ПараметрыФР.ФР_Объект;
	ПараметрыФР.ФР_СерийныйНомер                                            = "";

	Попытка
		ПараметрыФР.ФР_СерийныйНомер 										= пЭККР.ZNUM("000000");
	Исключение
		ПараметрыФР.ФР_СерийныйНомер                                        = ""; // ошибка
	КонецПопытки;
		
	Возврат ПараметрыФР.ФР_СерийныйНомер;

КонецФункции

Функция ПолучитьФискальныйНомер() Экспорт
	// Фискальный номер выдаеться налоговой. 
	// Он уникальный в пределах Укарины.
	// Длина ограничена (10 символов).

	пЭККР																	= ПараметрыФР.ФР_Объект;
	ПараметрыФР.ФР_ФискальныйНомер                                          = "";
	Попытка
		ПараметрыФР.ФР_ФискальныйНомер 										= пЭККР.FNUM("000000");
	Исключение
		ПараметрыФР.ФР_ФискальныйНомер 										= ""; // ошибка
	КонецПопытки;
	
	Возврат ПараметрыФР.ФР_ФискальныйНомер;

КонецФункции

Функция ПолучитьНомерЧекаФР(пЭККР) Экспорт //06.10.2012
	Попытка
		НомерЧекаККМ = Число(пЭККР.COUNTERSDAY(3,"000000"));
	Исключение
		НомерЧекаККМ = 0;
	КонецПопытки;
	
	Логирование.ДобавитьЗаписьЖурнала(, "ПолучитьНомерЧекаФР()", "НОМЕР ЧЕКА/ПАКЕТА ФР = " + НомерЧекаККМ, Неопределено, Неопределено, "Обработки.ТО_Datecs_FP_3530T");

КонецФункции

Функция ПолучитьНомерZОтчета_ТекущейСмены() Экспорт
	пЭККР																	= ПараметрыФР.ФР_Объект;
	ПараметрыФР.ФР_НомерZОтчета												= 0;
 
	Попытка
		ПараметрыФР.ФР_НомерZОтчета											= Число(пЭККР.COUNTERSDAY(0,"000000"));
	Исключение
		ПараметрыФР.ФР_НомерZОтчета	 										= 0; 
	КонецПопытки;
	
	Возврат ПараметрыФР.ФР_НомерZОтчета;
	
КонецФункции

Функция НулевойЧек(пЭККР) Экспорт
	Попытка
		Результат 	= пЭККР.INFO(0,0,"","000000");
		Ответ 		= пЭККР.INFO(1,0,"","000000"); 
		Ответ 		= пЭККР.INFO(2,0,Лев("Нульовий чек", 20),"000000");	
		Ответ 		= пЭККР.OPENFISKCHECK(1,1,0,"000000");	
		Ответ 		= пЭККР.PRNTOTAL(0,"000000");
		Ответ 		= пЭККР.PAYMENT(0,"0.00","000000");
		Ответ 		= пЭККР.CLOSEFISKCHECK(0,"000000");	
		Возврат Истина;
	Исключение
		Возврат Ложь;
	КонецПопытки;	

КонецФункции // Нулевой чек


//Функция осуществляет печать Х-отчёта на ФР.
Функция Х_отчет(пЭККР) Экспорт 
	Попытка
		Результат 	= пЭККР.INFO(0,0,"","000000");
		Ответ 		= пЭККР.INFO(1,0,"","000000"); 
		Ответ 		= пЭККР.INFO(2,0,Лев("Х-ЗВІТ", 20),"000000");	
		Результат 	= пЭККР.PrnRep(1,"000000"); // Печать Х-отчета
		Возврат Истина;
	Исключение
		Возврат Ложь;
	КонецПопытки;	

КонецФункции	

//Функция осуществляет печать Z-отчёта на ФР.
Функция Z_Отчет() Экспорт
	
	пЭККР		= ПараметрыФР.ФР_Объект;
	пМодем 		= ПараметрыФР.ФР_ОбъектМодем;
	
	Результат 	= пЭККР.INFO(0,0,"","000000");
	Ответ		= пЭККР.INFO(1,0,"","000000"); 
	Ответ		= пЭККР.INFO(2,0,Лев("Z-ЗВІТ", 20),"000000");	
	Результат	= пЭККР.PrnRep(0, "000000"); // Печать зет-отчета
	
	Если ОшибкаФР_Сообщить(СокрЛП(пЭККР.GETERROR)) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Ответ 	= пЭККР.CLEARCONTROLTAPE ("000000");
	Открыто = пЭККР.OpenBox("000000"); // Открытие денежного ящика
																			
	СерийныйНомерФР = Константы.осн_КассаККМ.Получить().Наименование;
	Если Константы.ТО_МодельФР.Получить() = 3 И Найти(СерийныйНомерФР,"АТ") <> 0 Тогда 
		Попытка
			ПечатьОтчетСостояниеМодема();
		Исключение
		КонецПопытки;	
	КонецЕсли;	
	
	Возврат Истина;

КонецФункции // ZОтчет()



Функция Сумма(пЭККР, Сумма) Экспорт
	
	Результат = пЭККР.INFO(0,0,"","000000");
	Если Сумма>0 Тогда
		Результат = пЭККР.INFO(1,0,"Служб.внесок","000000"); 
		Результат = пЭККР.INFO(2,0,Формат(Сумма, "Ч6.2"),"000000");
		Результат = пЭККР.MONEY(1,Формат(Сумма,"ЧЦ=10; ЧДЦ=2;ЧРД=.;ЧГ=0;ЧН=0.00"),"000000");
		Открыто   = пЭККР.OpenBox("000000"); // Открытие денежного ящика
	ИначеЕсли Сумма < 0 Тогда  
		Результат = пЭККР.INFO(1,0,"Iнкасацiя","000000"); 
		Результат = пЭККР.INFO(2,0,Формат(-Сумма, "Ч6.2"),"000000");
		Результат = пЭККР.MONEY(1,Формат(Сумма,"ЧЦ=10; ЧДЦ=2;ЧРД=.;ЧГ=0;ЧН=0.00"),"000000");
		Открыто   = пЭККР.OpenBox("000000"); // Открытие денежного ящика
	Иначе
		Возврат Ложь;
	КонецЕсли;
	Возврат Истина;

КонецФункции // Сумма()

Функция ОстатокКассы(пЭККР) Экспорт
	Попытка
		Рез													= СокрЛП(пЭККР.SUMDAY(3,0,0,1,"000000"));
		Если ОбщегоНазначения.ЭтоЧисло(Рез) Тогда 
			Результат										= Число(Рез);
		Иначе 	
			Результат										= 0;
		КонецЕсли;	
	Исключение 	
		Результат											= 0;
	КонецПопытки;

	Возврат Результат;
КонецФункции

Функция ОткрытьДенежныйЯщик(пЭККР) Экспорт 
	Открыто      		= пЭККР.OpenBox("000000"); 	
КонецФункции	



// *Совмещена с печатью строки UKN Проверить артикулы датекса
Функция РегистрацияАртикула_в_ФР(СтрокаТЧ) Экспорт
	пЭККР																	= ПараметрыФР.ФР_Объект;
	
	Если  СтрокаТЧ.СтавкаНДС=Перечисления.СтавкиНДС.НДС20 Тогда 
		ПризнакСтавкиНДС													= 0;		
	ИначеЕсли СтрокаТЧ.СтавкаНДС=Перечисления.СтавкиНДС.БезНДС Тогда 
		ПризнакСтавкиНДС													= 1;
	ИначеЕсли СтрокаТЧ.СтавкаНДС=Перечисления.СтавкиНДС.НДС7 Тогда 	
		ПризнакСтавкиНДС													= 2;
	ИначеЕсли СтрокаТЧ.СтавкаНДС=Перечисления.СтавкиНДС.Акциз5_НДС20 Тогда 	
		ПризнакСтавкиНДС													= 3;
	КонецЕсли;
	
    Попытка
		Результат 															= пЭККР.WRITEARTICLE(Число(СтрокаТЧ.Код), СтрокаТЧ.DATASTR2, ПризнакСтавкиНДС, 1, 1, "шт", "000000");
	Исключение
		Возврат Ложь;
	КонецПопытки;	
	
	Возврат Истина;
КонецФункции

Функция ПроверкаОборотовФР_ДоОткрытияЧека(пЭККР, ПараметрыЧекаККМ) Экспорт
	// ++ VS Ализируем ответил ли мне фискальник и правильные цифры он мне показывает.
	пФР_ОборотиПродаж_Картка													= "";
	пФР_ОборотиПродаж_Наличные													= "";
	пФР_ОборотиПродаж_ПС														= "";
	пФР_ОборотиПродаж_Ваучер													= "";
	пФР_ОборотиВозвратов_Картка													= "";
	пФР_ОборотиВозвратов_Наличные												= "";
	пФР_ОборотиВозвратов_ПС														= "";
	пФР_ОборотиВозвратов_Ваучер													= "";

	ПараметрыЧекаККМ.ФР_ОбротыДоЧека											= 0;
	ПараметрыЧекаККМ.ФР_ОбротыПослеЧека											= 0;

	Попытка
		Если ПараметрыЧекаККМ.ЭтоЧекПродажи Тогда 
			пФР_ОборотиПродаж_Наличные											= пЭККР.SUMDAY(2,0,0,1,"000000");
        	пФР_ОборотиПродаж_Картка											= пЭККР.SUMDAY(2,3,0,1,"000000");
        	пФР_ОборотиПродаж_ПС                                                = пЭККР.SUMDAY(2,4,0,1,"000000");
			пФР_ОборотиПродаж_Ваучер                                            = пЭККР.SUMDAY(2,5,0,1,"000000");
			
			ЧислоФР_ОборотиПродаж_Наличные           							= ?(ПустаяСтрока(пФР_ОборотиПродаж_Наличные), 	0, Число (пФР_ОборотиПродаж_Наличные));
			ЧислоФР_ОборотиПродаж_Картка             							= ?(ПустаяСтрока(пФР_ОборотиПродаж_Картка), 	0, Число (пФР_ОборотиПродаж_Картка));
		    ЧислоФР_ОборотиПродаж_ПС 	            							= ?(ПустаяСтрока(пФР_ОборотиПродаж_ПС), 		0, Число (пФР_ОборотиПродаж_ПС));
			ЧислоФР_ОборотиПродаж_Ваучер            							= ?(ПустаяСтрока(пФР_ОборотиПродаж_Ваучер), 	0, Число (пФР_ОборотиПродаж_Ваучер));


			ПараметрыЧекаККМ.ФР_ОбротыДоЧека									= ЧислоФР_ОборотиПродаж_Наличные + ЧислоФР_ОборотиПродаж_Картка + ЧислоФР_ОборотиПродаж_ПС + ЧислоФР_ОборотиПродаж_Ваучер;    
		Иначе 		
			пФР_ОборотиВозвратов_Наличные										= пЭККР.SUMDAY(2,0,0,2,"000000");
			пФР_ОборотиВозвратов_Картка											= пЭККР.SUMDAY(2,3,0,2,"000000");
			пФР_ОборотиВозвратов_ПС												= пЭККР.SUMDAY(2,4,0,2,"000000");
			пФР_ОборотиВозвратов_Ваучер											= пЭККР.SUMDAY(2,5,0,2,"000000");

			ЧислоФР_ОборотиВозвратов_Наличные           						= ?(ПустаяСтрока(пФР_ОборотиВозвратов_Наличные), 	0, Число (пФР_ОборотиВозвратов_Наличные));
			ЧислоФР_ОборотиВозвратов_Картка             						= ?(ПустаяСтрока(пФР_ОборотиВозвратов_Картка),	 	0, Число (пФР_ОборотиВозвратов_Картка));
			ЧислоФР_ОборотиВозвратов_ПС			           						= ?(ПустаяСтрока(пФР_ОборотиВозвратов_ПС), 			0, Число (пФР_ОборотиВозвратов_ПС));
			ЧислоФР_ОборотиВозвратов_Ваучер		           						= ?(ПустаяСтрока(пФР_ОборотиВозвратов_Ваучер), 		0, Число (пФР_ОборотиВозвратов_Ваучер));

			ЧислоФР_ОборотиВозвратов_Наличные           						= ?(ЧислоФР_ОборотиВозвратов_Наличные<0, 	ЧислоФР_ОборотиВозвратов_Наличные*(-1), ЧислоФР_ОборотиВозвратов_Наличные);
			ЧислоФР_ОборотиВозвратов_Картка             						= ?(ЧислоФР_ОборотиВозвратов_Картка<0, 		ЧислоФР_ОборотиВозвратов_Картка*(-1), 	ЧислоФР_ОборотиВозвратов_Картка);
			ЧислоФР_ОборотиВозвратов_ПС             							= ?(ЧислоФР_ОборотиВозвратов_ПС<0, 			ЧислоФР_ОборотиВозвратов_ПС*(-1), 		ЧислоФР_ОборотиВозвратов_ПС);
			ЧислоФР_ОборотиВозвратов_Ваучер             						= ?(ЧислоФР_ОборотиВозвратов_Ваучер<0, 		ЧислоФР_ОборотиВозвратов_Ваучер*(-1), 	ЧислоФР_ОборотиВозвратов_Ваучер);

			ПараметрыЧекаККМ.ФР_ОбротыДоЧека									= ЧислоФР_ОборотиВозвратов_Наличные + ЧислоФР_ОборотиВозвратов_Картка + ЧислоФР_ОборотиВозвратов_ПС + ЧислоФР_ОборотиВозвратов_Ваучер;  
		КонецЕсли;                                      
	    Возврат	Истина;
	Исключение
		ПараметрыЧекаККМ.ФР_ОбротыДоЧека										= 0;
		ПараметрыЧекаККМ.ФР_ОбротыПослеЧека										= 0;
		Возврат Ложь;	
	КонецПопытки;	
	
	Возврат Ложь;
КонецФункции


Функция ОткрытьЧек(пЭККР, ПараметрыЧекаККМ) Экспорт 
	Попытка
		//Мулько
		//Если ОшибкаФР_Сообщить(СокрЛП(пЭККР.GETERROR)) Тогда
		//	Возврат Ложь;
		//КонецЕсли;
		
		Если ПараметрыЧекаККМ.ЭтоЧекПродажи Тогда
			Ответ = пЭККР.OPENFISKCHECK(1,1,0,"000000");
		Иначе 	
			Ответ = пЭККР.OPENFISKCHECK(1,1,1,"000000"); 
		КонецЕсли;
		
		Возврат Истина;
	Исключение
		
		Возврат Ложь;
	КонецПопытки;	

КонецФункции	

Функция ПечатьКоментария(пЭККР, КомментарийМассив, ОткрытьЧекВозврата) Экспорт 
	Попытка
		Для Каждого СтрокаКомментария Из КомментарийМассив Цикл
			Ответ = пЭККР.PRNCHECK(СтрокаКомментария,"000000");
		КонецЦикла;	
		Возврат Истина;
	Исключение
		Возврат Ложь;
	КонецПопытки;
КонецФункции	

Функция ПечатьСтрокиЧека(пЭККР, ПризнакВозврата ,СтрокаТЧ) Экспорт
	Артикул				= СтрокаТЧ.Код;
	ЦенаТовара 			= СтрокаТЧ.Цена; 
	КвоТовара  			= СтрокаТЧ.Количество;
	СкидкаНаТовар		= СтрокаТЧ.СкидкаСумма+СтрокаТЧ.СкидкаБК;
	ФорматКво  			= Формат(КвоТовара, "ЧЦ=8;ЧДЦ=3;ЧРД=.;ЧГ=0;ЧН=0.00");
	ФорматЦен  			= Формат(ЦенаТовара, "ЧЦ=10;ЧДЦ=2;ЧРД=.;ЧГ=0;ЧН=0.00");
	ФорматАбс  			= Формат(-СкидкаНаТовар,"ЧЦ=10; ЧДЦ=2;ЧРД=.;ЧГ=0;ЧН=0.00");
	//ФорматОтн  		= Формат(-глСкидкаПроцент,"ЧЦ=10; ЧДЦ=2;ЧРД=.;ЧГ=0;ЧН=0.00");
	СкидкаПроцент		= 0; 
	СкидкаСумма			= 0;      
	
	// Дьяченко 25.10.2019
	// Возврат товара после округления по математическим правилам получаем наценку
	//Если СкидкаНаТовар < 0 Тогда
	//	ЦенаТовара = ЦенаТовара - СкидкаНаТовар;
	//	СкидкаНаТовар = 0;
	//КонецЕсли;	
	
	Попытка		
		//Абсолютная скидка
		Ответ     		= пЭККР.SALE(Число(Артикул), ФорматКво, ФорматЦен, "000000");
		Если НЕ СкидкаНаТовар = 0 Тогда
			Результат 	= пЭККР.DISCOUNT(ФорматАбс, "000000");
		КонецЕсли;
		Возврат Истина;
	Исключение
		Возврат Ложь;
	КонецПопытки;	
КонецФункции
//Скидка на весь чек
функция ПечатьСкидкиНаЧек(пЭККР, СуммаПС) Экспорт 
	Попытка
		ФорматДиск 			= Формат(-СуммаПС,"ЧЦ=10; ЧДЦ=2;ЧРД=.;ЧГ=0;ЧН=0.00");
		Ответ 				= пЭККР.DISCOUNTTOTAL(ФорматДиск, "000000");      
		Возврат Истина
	Исключение
		Возврат Ложь
	КонецПопытки;	
Конецфункции

Функция ЗакрытьЧек(пЭККР, ПараметрыЧекаККМ) Экспорт
																			
    Результат																= Ложь;
   	РезультатPAY  															= "0";	
	Попытка
		Ответ 																= пЭККР.PRNTOTAL(0,"000000");
						
		Если ПараметрыЧекаККМ.ФО_СуммаПоКарте>0 И СокрЛП(РезультатPAY)="0" Тогда
			ПечатьКоментария(пЭККР, ПараметрыЧекаККМ.POSтерминал_ТекстДляЧекаФР, ПараметрыЧекаККМ.ЭтоЧекВозврата);
			
			ФорматСуммы 													= Формат(ПараметрыЧекаККМ.ФО_СуммаПоКарте, "ЧЦ=10;ЧДЦ=2;ЧРД=.;ЧГ=0;ЧН=0.00");
			РезультатPAY  													= пЭККР.PAYMENT(3,ФорматСуммы,"000000");
		КонецЕсли;	
		
		Если ПараметрыЧекаККМ.ФО_СуммаВаучером>0 И СокрЛП(РезультатPAY)="0" Тогда
			ФорматСуммы 													= Формат(ПараметрыЧекаККМ.ФО_СуммаВаучером, "ЧЦ=10;ЧДЦ=2;ЧРД=.;ЧГ=0;ЧН=0.00");
			РезультатPAY  													= пЭККР.PAYMENT(5,ФорматСуммы,"000000");
		КонецЕсли;
		
		Если ПараметрыЧекаККМ.ФО_СуммаСертификатом>0 И СокрЛП(РезультатPAY)="0" Тогда
			ФорматСуммы 													= Формат(ПараметрыЧекаККМ.ФО_СуммаСертификатом, "ЧЦ=10;ЧДЦ=2;ЧРД=.;ЧГ=0;ЧН=0.00");
			РезультатPAY  													= пЭККР.PAYMENT(4,ФорматСуммы,"000000");
		КонецЕсли;
		
		Если ПараметрыЧекаККМ.ФО_СуммаНалички>0 И СокрЛП(РезультатPAY)="0" Тогда
			ФорматСуммы 													= Формат(ПараметрыЧекаККМ.ФО_СуммаНалички, "ЧЦ=10;ЧДЦ=2;ЧРД=.;ЧГ=0;ЧН=0.00");
			РезультатPAY  													= пЭККР.PAYMENT(0,ФорматСуммы,"000000");
		КонецЕсли;	
				
		РезультатCLOSE    													= пЭККР.CLOSEFISKCHECK(0,"000000");
		
		// Открытие денежного ящика
		Если ПараметрыЧекаККМ.ФО_СуммаНалички>0 Тогда
			Открыто      													= пЭККР.OpenBox("000000"); 	
		КонецЕсли;
		
		
		Если СокрЛП(РезультатCLOSE)<>"0" ИЛИ СокрЛП(пЭККР.GETERROR())<>"$0000" Тогда 
			ТекстСообщения													= 	"ВНИМАНИЕ!!! Нет связи с фискальным регистратором!!!" 		+ Символы.ПС + Символы.ПС + 
																				"Подробно об ошибке:" 										+ Символы.ПС + Символы.ПС + 
																				" CLOSEFISKCHECK = " + СокрЛП(РезультатCLOSE)				+ Символы.ПС + 
																				" GETERROR = " 		+ ?(ПустаяСтрока(СокрЛП(пЭККР.GETERROR())),"ПустаяСтрока",СокрЛП(пЭККР.GETERROR())) + Символы.ПС;
																				
			Возврат Ложь;
		КонецЕсли;	
	
		Результат		    												= Истина;
		
	Исключение
		Результат 															= Ложь;
	КонецПопытки;	
	
	Возврат Результат;	
КонецФункции	

Функция ПроверкаОборотовФР_ПослеЗакарытияЧека(пЭККР, ПараметрыЧекаККМ, КоличествоПопыток = 0, ВыдаватьПредупреждение = Истина) Экспорт
	СуммаПоЧеку																	= ПараметрыЧекаККМ.ФО_СуммаЧекаИтого;

	пФР_ОборотиПродаж_Картка													= "";
	пФР_ОборотиПродаж_Наличные													= "";
	пФР_ОборотиПродаж_ПС														= "";
	пФР_ОборотиПродаж_Ваучер													= "";
	пФР_ОборотиВозвратов_Картка													= "";
	пФР_ОборотиВозвратов_Наличные												= "";
	пФР_ОборотиВозвратов_ПС														= "";
	пФР_ОборотиВозвратов_Ваучер													= "";

	
	ПараметрыЧекаККМ.ФР_ОбротыПослеЧека											= 0;

	Попытка
		Если ПараметрыЧекаККМ.ЭтоЧекПродажи Тогда 
			пФР_ОборотиПродаж_Наличные											= пЭККР.SUMDAY(2,0,0,1,"000000");
        	пФР_ОборотиПродаж_Картка											= пЭККР.SUMDAY(2,3,0,1,"000000");
        	пФР_ОборотиПродаж_ПС                                                = пЭККР.SUMDAY(2,4,0,1,"000000");
			пФР_ОборотиПродаж_Ваучер                                            = пЭККР.SUMDAY(2,5,0,1,"000000");
				
			ЧислоФР_ОборотиПродаж_Наличные           							= ?(ПустаяСтрока(пФР_ОборотиПродаж_Наличные), 	0, Число (пФР_ОборотиПродаж_Наличные));
			ЧислоФР_ОборотиПродаж_Картка             							= ?(ПустаяСтрока(пФР_ОборотиПродаж_Картка), 	0, Число (пФР_ОборотиПродаж_Картка));
		    ЧислоФР_ОборотиПродаж_ПС 	            							= ?(ПустаяСтрока(пФР_ОборотиПродаж_ПС), 		0, Число (пФР_ОборотиПродаж_ПС));
			ЧислоФР_ОборотиПродаж_Ваучер 	            						= ?(ПустаяСтрока(пФР_ОборотиПродаж_Ваучер), 	0, Число (пФР_ОборотиПродаж_Ваучер));

			ПараметрыЧекаККМ.ФР_ОбротыПослеЧека									= ЧислоФР_ОборотиПродаж_Наличные + ЧислоФР_ОборотиПродаж_Картка + ЧислоФР_ОборотиПродаж_ПС + ЧислоФР_ОборотиПродаж_Ваучер;    
			
			Результат															= ((ПараметрыЧекаККМ.ФР_ОбротыПослеЧека-ПараметрыЧекаККМ.ФР_ОбротыДоЧека)=СуммаПоЧеку);
		Иначе 		
			
			пФР_ОборотиВозвратов_Наличные										= пЭККР.SUMDAY(2,0,0,2,"000000");
			пФР_ОборотиВозвратов_Картка											= пЭККР.SUMDAY(2,3,0,2,"000000");
			пФР_ОборотиВозвратов_ПС												= пЭККР.SUMDAY(2,4,0,2,"000000");
			пФР_ОборотиВозвратов_Ваучер											= пЭККР.SUMDAY(2,5,0,2,"000000");

			ЧислоФР_ОборотиВозвратов_Наличные           						= ?(ПустаяСтрока(пФР_ОборотиВозвратов_Наличные), 	0, Число (пФР_ОборотиВозвратов_Наличные));
			ЧислоФР_ОборотиВозвратов_Картка             						= ?(ПустаяСтрока(пФР_ОборотиВозвратов_Картка),	 	0, Число (пФР_ОборотиВозвратов_Картка));
			ЧислоФР_ОборотиВозвратов_ПС			           						= ?(ПустаяСтрока(пФР_ОборотиВозвратов_ПС), 			0, Число (пФР_ОборотиВозвратов_ПС));
			ЧислоФР_ОборотиВозвратов_Ваучер		           						= ?(ПустаяСтрока(пФР_ОборотиВозвратов_Ваучер), 		0, Число (пФР_ОборотиВозвратов_Ваучер));

			ЧислоФР_ОборотиВозвратов_Наличные           						= ?(ЧислоФР_ОборотиВозвратов_Наличные<0, 	ЧислоФР_ОборотиВозвратов_Наличные*(-1), ЧислоФР_ОборотиВозвратов_Наличные);
			ЧислоФР_ОборотиВозвратов_Картка             						= ?(ЧислоФР_ОборотиВозвратов_Картка<0, 		ЧислоФР_ОборотиВозвратов_Картка*(-1), 	ЧислоФР_ОборотиВозвратов_Картка);
			ЧислоФР_ОборотиВозвратов_ПС             							= ?(ЧислоФР_ОборотиВозвратов_ПС<0, 			ЧислоФР_ОборотиВозвратов_ПС*(-1), 		ЧислоФР_ОборотиВозвратов_ПС);
			ЧислоФР_ОборотиВозвратов_Ваучер            							= ?(ЧислоФР_ОборотиВозвратов_Ваучер<0, 		ЧислоФР_ОборотиВозвратов_Ваучер*(-1), 	ЧислоФР_ОборотиВозвратов_Ваучер);

			ПараметрыЧекаККМ.ФР_ОбротыПослеЧека									= ЧислоФР_ОборотиВозвратов_Наличные + ЧислоФР_ОборотиВозвратов_Картка + ЧислоФР_ОборотиВозвратов_ПС + ЧислоФР_ОборотиВозвратов_Ваучер;  
			
			Результат															= ((ПараметрыЧекаККМ.ФР_ОбротыПослеЧека-ПараметрыЧекаККМ.ФР_ОбротыДоЧека)=СуммаПоЧеку);
		КонецЕсли;                                      
	
	Исключение
		Результат																= Ложь;
	КонецПопытки;
	
	
	
	
	Если НЕ Результат Тогда
		Если ВыдаватьПредупреждение Тогда
			Результат																= ВыводСообщенияПользователю(	ПараметрыЧекаККМ.ЭтоЧекВозврата, 
																													СуммаПоЧеку, 
																													ПараметрыЧекаККМ.ФР_ОбротыДоЧека, 
																													ПараметрыЧекаККМ.ФР_ОбротыПослеЧека,
																													КоличествоПопыток);
		КонецЕсли;																											
	КонецЕсли;	
	   	
	Возврат Результат
КонецФункции

Функция ВыводСообщенияПользователю(ПризнакВозврата, СуммаПоЧеку, ОборотыПродаж_ДоЧека, ОборотыПродаж_ПослеЧека, КоличествоПопыток=0)
	ТекстСообщения			= "ВНИМАНИЕ !!! Нет подтверждения от ФР о закрытии чека !!!" + Символы.ПС + Символы.ПС;
	Если ПризнакВозврата Тогда 
	   	ТекстСообщения 		= ТекстСообщения+  "ПОДРОБНО:" 					+ Символы.ПС +  
								"ЧекВозвратаНаСумму 			= " 		+ Формат(СуммаПоЧеку,"ЧДЦ=2; ЧН=; ЧВН=") 					+ Символы.ПС +
								"ОборотыВозвратов_ДоЧека		= " 		+ Формат(ОборотыПродаж_ДоЧека,"ЧДЦ=2; ЧН=; ЧВН=")		+ Символы.ПС +
								"ОборотыВозвратов_ПослеЧека 	= " 		+ Формат(ОборотыПродаж_ПослеЧека,"ЧДЦ=2; ЧН=; ЧВН=")		+ Символы.ПС + Символы.ПС+
								"НЕОБХОДИМО ВЫПОЛНИТЬ:" 																+ Символы.ПС + 
                                " 1. Выключить ФР / Подождать 10 секунд / Включить ФР;" 								+ Символы.ПС +
								" 2. Нажимаем кнопку <ДА>;" 															+ Символы.ПС +
								" 3. Если ФР НЕ отвечает, для перезапуска 1С нажимаем кнопку <НЕТ>;" 					+ Символы.ПС +
								" 4. Если не помогло, звоните админу или в службу поддержки;" 							+ Символы.ПС + Символы.ПС + 
                                "ВОПРОС: Попробуем получить данные с ФР повторно ???";
								//Мулько 18.10.2019
								Если КоличествоПопыток > 0 тогда
									ТекстСообщения = ТекстСообщения + Символы.ПС +"
									|КОЛИЧЕСТВО ПОПЫТОК ОСТАЛОСЬ: " + Строка(КоличествоПопыток);
								КонецЕсли;	

    Иначе 
        ТекстСообщения 		= ТекстСообщения+  "ПОДРОБНО:" 			+ Символы.ПС +
								"ЧекПродажиНаСумму 				= " 		+ Формат(СуммаПоЧеку,"ЧДЦ=2; ЧН=; ЧВН=") 					+ Символы.ПС +
								"ОборотыПродаж_ДоЧека			= " 		+ Формат(ОборотыПродаж_ДоЧека,"ЧДЦ=2; ЧН=; ЧВН=")			+ Символы.ПС +
								"ОборотыПродаж_ПослеЧека		= " 		+ Формат(ОборотыПродаж_ПослеЧека,"ЧДЦ=2; ЧН=; ЧВН=")		+ Символы.ПС + Символы.ПС+
								"НЕОБХОДИМО ВЫПОЛНИТЬ:" 																+ Символы.ПС + 
                                " 1. Выключить ФР / Подождать 10 секунд / Включить ФР;" 								+ Символы.ПС +
								" 2. Нажимаем кнопку <ДА>;" 															+ Символы.ПС +
								" 3. Если ФР НЕ отвечает, для перезапуска 1С нажимаем кнопку <НЕТ>;" 					+ Символы.ПС +
								" 4. Если не помогло, звоните админу или в службу поддержки;" 							+ Символы.ПС + Символы.ПС + 
                                "ВОПРОС: Попробуем получить данные с ФР повторно ???";
								//Мулько 18.10.2019
								Если КоличествоПопыток > 0 тогда
									ТекстСообщения = ТекстСообщения + Символы.ПС +"
									|КОЛИЧЕСТВО ПОПЫТОК ОСТАЛОСЬ: " + Строка(КоличествоПопыток);
								КонецЕсли;	
	КонецЕсли;
	
	Режим = РежимДиалогаВопрос.ДаНет;
	Ответ = Вопрос(ТекстСообщения, Режим, 0,,"ВНИМАНИЕ !!! Не пройден контроль печати чека !!!");
	Если Ответ = КодВозвратаДиалога.Нет Тогда
   		Возврат Неопределено;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции	

////Мулько 11.11.2019
Функция ПолучитьОборотыФР_АварийныйЧек(пЭККР, ПараметрыЧекаККМ) Экспорт
	
	// ++ VS Ализируем ответил ли мне фискальник и правильные цифры он мне показывает.
	пФР_ОборотиПродаж_Картка													= "";
	пФР_ОборотиПродаж_Наличные													= "";
	пФР_ОборотиПродаж_ПС														= "";
	пФР_ОборотиПродаж_Ваучер													= "";
	пФР_ОборотиВозвратов_Картка													= "";
	пФР_ОборотиВозвратов_Наличные												= "";
	пФР_ОборотиВозвратов_ПС														= "";
	пФР_ОборотиВозвратов_Ваучер													= "";

	ПараметрыЧекаККМ.ФР_ОбротыПослеЧека											= 0;

	Попытка
		Если ПараметрыЧекаККМ.ЭтоЧекПродажи Тогда 
			пФР_ОборотиПродаж_Наличные											= пЭККР.SUMDAY(2,0,0,1,"000000");
        	пФР_ОборотиПродаж_Картка											= пЭККР.SUMDAY(2,3,0,1,"000000");
        	пФР_ОборотиПродаж_ПС                                                = пЭККР.SUMDAY(2,4,0,1,"000000");
			пФР_ОборотиПродаж_Ваучер                                            = пЭККР.SUMDAY(2,5,0,1,"000000");
			
			ЧислоФР_ОборотиПродаж_Наличные           							= ?(ПустаяСтрока(пФР_ОборотиПродаж_Наличные), 	0, Число (пФР_ОборотиПродаж_Наличные));
			ЧислоФР_ОборотиПродаж_Картка             							= ?(ПустаяСтрока(пФР_ОборотиПродаж_Картка), 	0, Число (пФР_ОборотиПродаж_Картка));
		    ЧислоФР_ОборотиПродаж_ПС 	            							= ?(ПустаяСтрока(пФР_ОборотиПродаж_ПС), 		0, Число (пФР_ОборотиПродаж_ПС));
			ЧислоФР_ОборотиПродаж_Ваучер            							= ?(ПустаяСтрока(пФР_ОборотиПродаж_Ваучер), 	0, Число (пФР_ОборотиПродаж_Ваучер));


			ПараметрыЧекаККМ.ФР_ОбротыПослеЧека									= ЧислоФР_ОборотиПродаж_Наличные + ЧислоФР_ОборотиПродаж_Картка + ЧислоФР_ОборотиПродаж_ПС + ЧислоФР_ОборотиПродаж_Ваучер;    
		Иначе 		
			пФР_ОборотиВозвратов_Наличные										= пЭККР.SUMDAY(2,0,0,2,"000000");
			пФР_ОборотиВозвратов_Картка											= пЭККР.SUMDAY(2,3,0,2,"000000");
			пФР_ОборотиВозвратов_ПС												= пЭККР.SUMDAY(2,4,0,2,"000000");
			пФР_ОборотиВозвратов_Ваучер											= пЭККР.SUMDAY(2,5,0,2,"000000");

			ЧислоФР_ОборотиВозвратов_Наличные           						= ?(ПустаяСтрока(пФР_ОборотиВозвратов_Наличные), 	0, Число (пФР_ОборотиВозвратов_Наличные));
			ЧислоФР_ОборотиВозвратов_Картка             						= ?(ПустаяСтрока(пФР_ОборотиВозвратов_Картка),	 	0, Число (пФР_ОборотиВозвратов_Картка));
			ЧислоФР_ОборотиВозвратов_ПС			           						= ?(ПустаяСтрока(пФР_ОборотиВозвратов_ПС), 			0, Число (пФР_ОборотиВозвратов_ПС));
			ЧислоФР_ОборотиВозвратов_Ваучер		           						= ?(ПустаяСтрока(пФР_ОборотиВозвратов_Ваучер), 		0, Число (пФР_ОборотиВозвратов_Ваучер));

			ЧислоФР_ОборотиВозвратов_Наличные           						= ?(ЧислоФР_ОборотиВозвратов_Наличные<0, 	ЧислоФР_ОборотиВозвратов_Наличные*(-1), ЧислоФР_ОборотиВозвратов_Наличные);
			ЧислоФР_ОборотиВозвратов_Картка             						= ?(ЧислоФР_ОборотиВозвратов_Картка<0, 		ЧислоФР_ОборотиВозвратов_Картка*(-1), 	ЧислоФР_ОборотиВозвратов_Картка);
			ЧислоФР_ОборотиВозвратов_ПС             							= ?(ЧислоФР_ОборотиВозвратов_ПС<0, 			ЧислоФР_ОборотиВозвратов_ПС*(-1), 		ЧислоФР_ОборотиВозвратов_ПС);
			ЧислоФР_ОборотиВозвратов_Ваучер             						= ?(ЧислоФР_ОборотиВозвратов_Ваучер<0, 		ЧислоФР_ОборотиВозвратов_Ваучер*(-1), 	ЧислоФР_ОборотиВозвратов_Ваучер);

			ПараметрыЧекаККМ.ФР_ОбротыПослеЧека									= ЧислоФР_ОборотиВозвратов_Наличные + ЧислоФР_ОборотиВозвратов_Картка + ЧислоФР_ОборотиВозвратов_ПС + ЧислоФР_ОборотиВозвратов_Ваучер;  
		КонецЕсли;                                      
	    Возврат	Истина;
	Исключение
		ПараметрыЧекаККМ.ФР_ОбротыПослеЧека										= 0;
		Возврат Ложь;	
	КонецПопытки;	
	
	Возврат Истина;
	
КонецФункции


// *Функция осуществляет аннулирование текущего открытого чека на ФР.
Функция АннулироватьЧек(пЭККР) Экспорт

	// Аннулировать чек
	Попытка
		Ответ = пЭККР.ANULIROVT(0,"000000");
		Возврат Истина;
	Исключение
		Возврат Ложь;
	КонецПопытки;

КонецФункции 

Функция ПолнаяАннуляцияЧека(пЭККР) Экспорт
	Попытка
		Ответ = пЭККР.ANULIROVT(0,"000000");
		Возврат Истина;
	Исключение
		Возврат Ложь;
	КонецПопытки;

КонецФункции	






//////////////////////////////////////////////////////////////////////////////////////////////
//                        ВЫВОД НА ДИСПЛЕЙ ФР !!!                                           //
// *UKN Функция осуществляет вывод строки на две строки диспля ФР
//
Функция ДисплейВерхВниз(пЭККР, Данные1 ,Данные2) Экспорт
	Попытка
		Результат = пЭККР.INFO(0,0,"","000000");
		Результат = пЭККР.INFO(1,0,Лев(Данные1, 20),"000000");	
		Результат = пЭККР.INFO(2,0,Лев(Данные2, 20),"000000");	
		Возврат Истина
	Исключение	
		Возврат Ложь;
	КонецПопытки;	
КонецФункции 
//                                                                                         	//
//////////////////////////////////////////////////////////////////////////////////////////////


// *Можно печатать сколько угодно копий
Функция ПечатьКопииПоследнегоФискальногоЧека(пЭККР) Экспорт
	АннулироватьЧек(пЭККР);
	
	Номер 			= 0; 
	Номер 			= Число(пЭККР.COUNTERSDAY(3,"000000"));
	
	Если пЭККР.GETERROR <> "$0000" Тогда
		Номер 		= 0;
		ВвестиЧисло(Номер,"Введите фискальный номер чека (внизу каждого чека ФР печатет свой номер)",9,0);
    КонецЕсли;
	    
	Попытка
		Ответ1 	= пЭККР.OPENCHECK("000000");
		Ответ2 	= пЭККР.PRNFISKCHECK(Номер, Номер, "000000");
		Ответ3 	= пЭККР.CLOSECHECK(0,"000000");

		Если Ответ2=0 Тогда 
	    	Возврат	Истина;
		Иначе 
			Возврат	Ложь;
		КонецЕсли;	
			
	Исключение
		Возврат	Ложь; 		// ошибка
	КонецПопытки;
КонецФункции



// *UKN Функция осуществляет печать короткого периодического отчета по датам
Функция КороткийОтчетПоДатам(пЭККР, С_Даты, По_Дату) Экспорт
	
	//С_Даты 		= Лев(С_Даты,2)+Сред(С_Даты,3,2)+Прав(С_Даты,2);
	//По_Дату 		= Лев(По_Дату,2)+Сред(По_Дату,3,2)+Прав(По_Дату,2);
	
	Результат 		= пЭККР.OPENCHECK("000000");
	Результат 		= пЭККР.PRNPERIODDATE( Формат(С_Даты, "ДФ=ddMMyy"),  Формат(По_Дату, "ДФ=ddMMyy"), 0, "000000");// дата в формате ГГГГММДД
	Результат 		= пЭККР.CLOSECHECK(0,"000000");
	Возврат Истина;

КонецФункции //

// *UKN Функция осуществляет печать полного периодического отчета по датам
Функция ПолныйОтчетПоДатам(пЭККР, С_Даты, По_Дату) Экспорт
	
	//С_Даты 			= Лев(С_Даты,2)+Сред(С_Даты,3,2)+Прав(С_Даты,2);
	//По_Дату 		= Лев(По_Дату,2)+Сред(По_Дату,3,2)+Прав(По_Дату,2);
	
	Результат 		= пЭККР.OPENCHECK("000000");
	Результат 		= пЭККР.PRNPERIODDATE(Формат(С_Даты, "ДФ=ddMMyy"), Формат(По_Дату, "ДФ=ddMMyy"), 1, "000000");// дата в формате ГГГГММДД
	Результат 		= пЭККР.CLOSECHECK(0,"000000");
	Возврат Истина;

КонецФункции //

// *UKN Функция осуществляет печать короткого периодического отчета по номерам
Функция КороткийОтчетПоНомерам(пЭККР, С_Номера, По_Номер) Экспорт
	
	Если (С_Номера > 9999) или ( С_Номера < 1) Тогда
		 Предупреждение("Неверный диапазон номеров Z отчетов"); Возврат Ложь;
	КонецЕсли;
	Результат = пЭККР.OPENCHECK("000000");
	Результат = пЭККР.PRNPERIODNUM(С_Номера, По_Номер, 0, "000000");
	Результат = пЭККР.CLOSECHECK(0,"000000");
	Возврат Истина;

КонецФункции //

// *UKN Функция осуществляет печать полного периодического отчета по номерам
Функция ПолныйОтчетПоНомерам(пЭККР, С_Номера, По_Номер) Экспорт
	
	Если (С_Номера > 9999) или ( С_Номера < 1) Тогда
		 Предупреждение("Неверный диапазон номеров Z отчетов"); Возврат Ложь;
	КонецЕсли;
	Результат = пЭККР.OPENCHECK("000000");
	Результат = пЭККР.PRNPERIODNUM(С_Номера, По_Номер, 1, "000000");
	Результат = пЭККР.CLOSECHECK(0,"000000");
	Возврат Истина;

КонецФункции //



Функция ОткрытьЗакрытьНефискальныйЧек(пЭККР, ОткрытьЗакрыть) Экспорт
	Если ОткрытьЗакрыть = Истина Тогда
		Ответ = пЭККР.OPENCHECK("000000");
	Иначе
		Ответ = пЭККР.CLOSECHECK(0,"000000");
	КонецЕсли;
	
	Возврат Истина;
КонецФункции
// *Функция осуществляет построчную печать нефискального чека из переданного массива строк.
Функция НапечататьСтроки(пЭККР, МассивСтрок, Ширина) Экспорт
	Ширина    = 34;
	Для Каждого СтрокаМассива Из МассивСтрок Цикл
		Если СтрДлина(СтрокаМассива) > Ширина Тогда
			Последние7 = Прав(СтрокаМассива, 7);
			ПозДвухТчк = Найти(Последние7, ":");
			Если ПозДвухТчк > 0 Тогда
				Окончание = Сред(Последние7, ПозДвухТчк + 1);
				ДлинаОкон = СтрДлина(Окончание);
			Иначе
				Окончание = Последние7;
				ДлинаОкон = СтрДлина(Окончание);
			КонецЕсли;
			СтрокаМассива = Лев(СтрокаМассива, Ширина - ДлинаОкон) + Окончание;
		КонецЕсли;
		Результат = пЭККР.PRNCHECK(СтрокаМассива, "000000"); // Печать текста в служебном чеке			
	КонецЦикла;
	Возврат Результат;

КонецФункции // НапечататьСтроки()

//Мулько К.П.
Функция ПолучитьСостояниеМодема() Экспорт 
	
	пЭККР                                                                   = ПараметрыФР.ФР_Объект;
	пМодем                                                                  = ПараметрыФР.ФР_ОбъектМодем;
		
	СтруктураОтвета = Новый Структура;
	СтруктураОтвета.Вставить("ЕстьДанные", Ложь);
	
	Если пЭККР=Неопределено Тогда
		Возврат СтруктураОтвета;
	КонецЕсли;
	
	СтруктураОтвета.ЕстьДанные = Истина;
	
	Ответ																	= пЭККР.Get_REPORTSTATUSMODEM(1,"000000");
	Ответ																	= СтрЗаменить(Ответ,";",Символы.ПС);
	ДатаСтрока																= ?(СтрПолучитьСтроку(Ответ,9)="000000","010100",СтрПолучитьСтроку(Ответ,9));
    
	ДатаНеОтправленного														= ДатаИзПредставленияДМГЧМС(ДатаСтрока, "00:00:00");
	
	
	Если ДатаНеОтправленного=Дата(2136,02,07) ИЛИ ДатаНеОтправленного=Дата(2000,01,01) Тогда 
		СтруктураОтвета.Вставить("ПакетыОтправлены", Истина);
		СтруктураОтвета.Вставить("ДатаОтправки", ДатаСтрока);
	ИначеЕсли НачалоДня(ТекущаяДата())-ДатаНеОтправленного=0 Тогда 
		СтруктураОтвета.Вставить("ПакетыОтправлены", Истина);
		СтруктураОтвета.Вставить("ДатаОтправки", ДатаСтрока);
	Иначе
		СтруктураОтвета.Вставить("ПакетыОтправлены", Ложь);
		СтруктураОтвета.Вставить("ДатаОтправки", ДатаСтрока);
	КонецЕсли;	
	
	Возврат СтруктураОтвета;
	
КонецФункции	

Функция ПечатьОтчетСостояниеМодема() Экспорт 
	пЭККР                                                                   = ПараметрыФР.ФР_Объект;
	пМодем                                                                  = ПараметрыФР.ФР_ОбъектМодем;
		
	Если пЭККР=Неопределено Тогда    										Возврат Ложь;	КонецЕсли;
	
	Ответ																	= пЭККР.Get_REPORTSTATUSMODEM(1,"000000");
	Ответ																	= СтрЗаменить(Ответ,";",Символы.ПС);
	ДатаСтрока																= ?(СтрПолучитьСтроку(Ответ,9)="000000","010100",СтрПолучитьСтроку(Ответ,9));
    
	ДатаНеОтправленного														= ДатаИзПредставленияДМГЧМС(ДатаСтрока, "00:00:00");
	
	МассивСтрок																= Новый Массив;
	МассивСтрок.Добавить(" ");
	МассивСтрок.Добавить("**********************");	
	Если ДатаНеОтправленного=Дата(2136,02,07) ИЛИ ДатаНеОтправленного=Дата(2000,01,01) Тогда 
		МассивСтрок.Добавить("*****    ВІТАЮ    ****");
		МассивСтрок.Добавить("ВСІ ПАКЕТИ відправ");
		МассивСтрок.Добавить("ленні на еквайринг !!!");
	ИначеЕсли НачалоДня(ТекущаяДата())-ДатаНеОтправленного=0 Тогда 
		МассивСтрок.Добавить("*****    ВІТАЮ    ****");
		МассивСтрок.Добавить("МАЙЖЕ ВСІ ПАКЕТИ відп" );
		МассивСтрок.Добавить("равленні на еквайринг!");  
		МассивСтрок.Добавить("ВСІ ПАКЕТИ будуть");
		МассивСтрок.Добавить("відправленні АВТОМАТ.");
		МассивСтрок.Добавить("пізніше або завтра!");
		МассивСтрок.Добавить("**********************");
		МассивСтрок.Добавить("Дата першого не ");
		МассивСтрок.Добавить("відправленного пакету:");
		МассивСтрок.Добавить("   " + ДатаСтрока);
	Иначе
		МассивСтрок.Добавить("*****    УВАГА    ****");
		МассивСтрок.Добавить("**********************");
		МассивСтрок.Добавить("Більше доби дані з РРО");
		МассивСтрок.Добавить("не відправляються на");
		МассивСтрок.Добавить("еквайринг !!!");
		МассивСтрок.Добавить("**********************");
		МассивСтрок.Добавить("Дата першого не ");
		МассивСтрок.Добавить("відправленного пакету:");
		МассивСтрок.Добавить("   " + ДатаСтрока);

		МассивСтрок.Добавить(" ");
		МассивСтрок.Добавить("**********************");
		МассивСтрок.Добавить("***** ОБОВ'ЯЗКОВО ****");
		МассивСтрок.Добавить("**********************");
		МассивСтрок.Добавить("Зверніться до ");
		МассивСтрок.Добавить("сист. адміністратора!");
		МассивСтрок.Добавить("----------------------");
	КонецЕсли;
	МассивСтрок.Добавить("**********************");
	МассивСтрок.Добавить(" ");
	
	//МассивСтрок.Добавить("Дата останньої успішної передачі пакетів:");
	//МассивСтрок.Добавить("   " + ДатаСтрока);
	//МассивСтрок.Добавить(" ");
	//МассивСтрок.Добавить("**********************");

	
	
	ОткрытьЗакрытьНефискальныйЧек(пЭККР, Истина);
	НапечататьСтроки(пЭККР, МассивСтрок, 34);
	ОткрытьЗакрытьНефискальныйЧек(пЭККР, Ложь);

	
	
	//Если НачалоДня(ТекущаяДата())-ДатаНеОтправленного>=24*60*60 И ДатаНеОтправленного<>Дата(2136,02,07) И ДатаНеОтправленного<>Дата(2000,01,01) Тогда 
	//	//МассивСтрок						= Новый Массив;
	//	//МассивСтрок.Добавить(" ");
	//	//МассивСтрок.Добавить("!!!  УВАГА  !!!");
	//	//МассивСтрок.Добавить("Більше доби дані з РРО");
	//	//МассивСтрок.Добавить("не відправляються на ");
	//	//МассивСтрок.Добавить("еквайринг!");
	//	//МассивСтрок.Добавить(" ");
	//	//МассивСтрок.Добавить("!!! ОБОВ'ЯЗКОВО !!! ");
	//	//МассивСтрок.Добавить("Зверніться до");
	//	//МассивСтрок.Добавить("сист. адміністратора!");
	//	//МассивСтрок.Добавить("------------------------");
	//	
	//	ОткрытьЗакрытьНефискальныйЧек(пЭККР, Истина);
	//	НапечататьСтроки(пЭККР, МассивСтрок, 34);
	//	ОткрытьЗакрытьНефискальныйЧек(пЭККР, Ложь);
	//   КонецЕсли;
		
	Возврат Истина;
КонецФункции	


Функция РегистрацияДопФормОплаты(пЭККР) Экспорт 
	//Если НЕ пЭККР.GetSmenaOpened Тогда 
		РЕЗ = пЭККР.SETPAYMENT(3, 3,"КАРТКА", 		"000000");
		РЕЗ = пЭККР.SETPAYMENT(4, 1,"СЕРТИФІКАТ", 	"000000");
		РЕЗ = пЭККР.SETPAYMENT(5, 1,"ВАУЧЕР", 		"000000");
	//КонецЕсли;	
КонецФункции	