&НаКлиентеНаСервере
перем глРРО Экспорт;	

&НаСервере
перем глСКАНЕР Экспорт;

Перем глОбщиеЗначения Экспорт;

Процедура ПриНачалеРаботыСистемы()
	Попытка
		//ЗагрузитьВнешнююКомпоненту("c:\Program Files (x86)\ATOL\Drivers\Bin\Scaner1C.dll");
		//УстановитьВнешнююКомпоненту("c:\Program Files (x86)\ATOL\Drivers\Bin\Scaner1C.dll");
		//ПодключитьВнешнююКомпоненту("c:\Program Files (x86)\ATOL\Drivers\Bin\Scaner1C.dll");
		//ЗагрузитьВнешнююКомпоненту("AddIn.Scaner45");
		ПодключитьВнешнююКомпоненту("AddIn.Scaner45");
		    //Сообщить("Внешняя компонента сканера штрих-кода успешно загружена");
		Попытка
		          Scaner = Новый("AddIn.Scaner45");
		          Scaner.OldVersion = 0;
		          Scaner.AutoDisable = 1;
		          Scaner.DataEventEnabled = 1;
		Исключение
		      Сообщить("Объект не найден");
		КонецПопытки;
	Исключение
	    Сообщить("Внешняя компонента сканера штрих-кода - Scaner1C.DLL не найдена");
	КонецПопытки;

КонецПроцедуры

  
Функция глЗначениеПеременной(Имя) Экспорт

	Возврат ОбщегоНазначения.ПолучитьЗначениеПеременной(Имя, глОбщиеЗначения);
	
КонецФункции


// Процедура установки значения экспортных переменных модуля приложения
//
// Параметры
//  Имя - строка, содержит имя переменной целиком
// 	Значение - значение переменной
//
Процедура глЗначениеПеременнойУстановить(Имя, Значение, ОбновлятьВоВсехКэшах = Ложь) Экспорт
	
	ОбщегоНазначения.УстановитьЗначениеПеременной(Имя, глОбщиеЗначения, Значение, ОбновлятьВоВсехКэшах);
	
КонецПроцедуры


